[Killed] MethodCallRemoval
Actions/Fortify/CreateNewUser.php:28:9
     #[Override]
     public function create(array $input): User
     {
-        Validator::make($input, [
-            'name' => ['required', 'string', 'max:255'],
-            'email' => [
-                'required',
-                'string',
-                'email',
-                'max:255',
-                Rule::unique(User::class),
-            ],
-            'password' => $this->passwordRules(),
-        ])->validate();
+        
 
         // Use RegisterUserHandler for consistency with CQRS pattern
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.
