[Killed] ProtectedVisibility
Actions/Fortify/PasswordValidationRules.php:18:5
      *
      * @psalm-return list{'required', 'string', Password, 'confirmed'}
      */
-    protected function passwordRules(): array
+    private function passwordRules(): array
     {
         return ['required', 'string', Password::default(), 'confirmed'];
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] ArrayItemRemoval
Actions/Fortify/PasswordValidationRules.php:20:9
      */
     protected function passwordRules(): array
     {
-        return ['required', 'string', Password::default(), 'confirmed'];
+        return ['string', Password::default(), 'confirmed'];
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.
