[Killed] PublicVisibility
Actions/Fortify/ResetUserPassword.php:21:5
      *
      * @param  array<string, string>  $input
      */
-    public function reset(User $user, array $input): void
+    protected function reset(User $user, array $input): void
     {
         Validator::make($input, [
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.

[Killed] MethodCallRemoval
Actions/Fortify/ResetUserPassword.php:23:9
      */
     public function reset(User $user, array $input): void
     {
-        Validator::make($input, [
-            'password' => $this->passwordRules(),
-        ])->validate();
+        
 
         $user->forceFill([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.

[Killed] MethodCallRemoval
Actions/Fortify/ResetUserPassword.php:27:9
             'password' => $this->passwordRules(),
         ])->validate();
 
-        $user->forceFill([
-            'password' => Hash::make($input['password']),
-        ])->save();
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.
