[Killed] PublicVisibility
Actions/Teams/CreateTeam.php:20:5
      *
      * @param  array<string, mixed>  $data
      */
-    public function handle(array $data): Team
+    protected function handle(array $data): Team
     {
         /** @var Team */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] InstanceOf_
Actions/Teams/CreateTeam.php:26:13
         return DB::transaction(static function () use ($data): Team {
             /** @var TeamType|string|int|null $typeValue */
             $typeValue = $data['type'] ?? null;
-            if (! ($typeValue instanceof TeamType)) {
+            if ($typeValue instanceof TeamType) {
                 throw_if(! is_string($typeValue) && ! is_int($typeValue), InvalidArgumentException::class, 'Type must be a TeamType instance, string, or int');
                 /** @var string|int $typeValue */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] LogicalAnd
Actions/Teams/CreateTeam.php:27:17
             /** @var TeamType|string|int|null $typeValue */
             $typeValue = $data['type'] ?? null;
             if (! ($typeValue instanceof TeamType)) {
-                throw_if(! is_string($typeValue) && ! is_int($typeValue), InvalidArgumentException::class, 'Type must be a TeamType instance, string, or int');
+                throw_if(!is_string($typeValue) || !is_int($typeValue), InvalidArgumentException::class, 'Type must be a TeamType instance, string, or int');
                 /** @var string|int $typeValue */
                 $type = TeamType::from($typeValue);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Actions/Teams/CreateTeam.php:27:17
             /** @var TeamType|string|int|null $typeValue */
             $typeValue = $data['type'] ?? null;
             if (! ($typeValue instanceof TeamType)) {
-                throw_if(! is_string($typeValue) && ! is_int($typeValue), InvalidArgumentException::class, 'Type must be a TeamType instance, string, or int');
+                throw_if(is_string($typeValue) && is_int($typeValue), InvalidArgumentException::class, 'Type must be a TeamType instance, string, or int');
                 /** @var string|int $typeValue */
                 $type = TeamType::from($typeValue);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] Ternary
Actions/Teams/CreateTeam.php:38:13
 
             // Resolve Parent
             /** @var Team|null $parent */
-            $parent = $parentId ? Team::query()->withoutGlobalScopes()->find($parentId) : null;
+            $parent = $parentId ? null : Team::query()->withoutGlobalScopes()->find($parentId);
 
             // Run Validation
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/CreateTeam.php:41:13
             $parent = $parentId ? Team::query()->withoutGlobalScopes()->find($parentId) : null;
 
             // Run Validation
-            TeamHierarchyValidator::validate($type, $parent);
+            
 
             // Determine Tenant (Enterprise logic)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] InstanceOf_
Actions/Teams/CreateTeam.php:45:13
 
             // Determine Tenant (Enterprise logic)
             $tenantId = null;
-            if ($parent instanceof Team) {
+            if (!$parent instanceof Team) {
                 $tenantId = $parent->type === TeamType::ENTERPRISE ? $parent->id : $parent->tenant_id;
             }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] Ternary
Actions/Teams/CreateTeam.php:46:17
             // Determine Tenant (Enterprise logic)
             $tenantId = null;
             if ($parent instanceof Team) {
-                $tenantId = $parent->type === TeamType::ENTERPRISE ? $parent->id : $parent->tenant_id;
+                $tenantId = $parent->type === TeamType::ENTERPRISE ? $parent->tenant_id : $parent->id;
             }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] Identical
Actions/Teams/CreateTeam.php:49:13
                 $tenantId = $parent->type === TeamType::ENTERPRISE ? $parent->id : $parent->tenant_id;
             }
 
-            if (! $parent && $type === TeamType::ENTERPRISE) {
+            if (!$parent && $type !== TeamType::ENTERPRISE) {
                 $tenantId = null; // Will be set to self ID after creation
             }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Actions/Teams/CreateTeam.php:49:13
                 $tenantId = $parent->type === TeamType::ENTERPRISE ? $parent->id : $parent->tenant_id;
             }
 
-            if (! $parent && $type === TeamType::ENTERPRISE) {
+            if ($parent && !($type === TeamType::ENTERPRISE)) {
                 $tenantId = null; // Will be set to self ID after creation
             }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] ArrayItemRemoval
Actions/Teams/CreateTeam.php:54:13
             }
 
             // Create team (observer will validate hierarchy and unique name)
-            $team = Team::query()->create([
-                ...$data,
-                'tenant_id' => $tenantId,
-            ]);
+            $team = Team::query()->create(['tenant_id' => $tenantId]);
 
             // Fix Enterprise Self-Referential Tenant ID
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] SpreadRemoval
Actions/Teams/CreateTeam.php:55:17
 
             // Create team (observer will validate hierarchy and unique name)
             $team = Team::query()->create([
-                ...$data,
+                $team = Team::query()->create([$data, 'tenant_id' => $tenantId]);
                 'tenant_id' => $tenantId,
             ]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] SpreadOneItem
Actions/Teams/CreateTeam.php:55:17
 
             // Create team (observer will validate hierarchy and unique name)
             $team = Team::query()->create([
-                ...$data,
+                $team = Team::query()->create([[...$data][0], 'tenant_id' => $tenantId]);
                 'tenant_id' => $tenantId,
             ]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] Identical
Actions/Teams/CreateTeam.php:60:13
             ]);
 
             // Fix Enterprise Self-Referential Tenant ID
-            if ($type === TeamType::ENTERPRISE) {
+            if ($type !== TeamType::ENTERPRISE) {
                 $team->updateQuietly(['tenant_id' => $team->id]);
             }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.
