[Killed] PublicVisibility
Actions/Teams/UpdateTeam.php:25:5
      *
      * @param  array<string, mixed>  $data
      */
-    public function handle(Team $team, array $data): Team
+    protected function handle(Team $team, array $data): Team
     {
         /** @var Team */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:29:13
     {
         /** @var Team */
         return DB::transaction(function () use ($team, $data): Team {
-            $this->checkOptimisticLock($team, $data);
+            
             $this->handleMoveIfNeeded($team, $data);
             $this->handleTranslatableFields($team, $data);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:30:13
         /** @var Team */
         return DB::transaction(function () use ($team, $data): Team {
             $this->checkOptimisticLock($team, $data);
-            $this->handleMoveIfNeeded($team, $data);
+            
             $this->handleTranslatableFields($team, $data);
             $this->handleStandardFields($team, $data);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:31:13
         return DB::transaction(function () use ($team, $data): Team {
             $this->checkOptimisticLock($team, $data);
             $this->handleMoveIfNeeded($team, $data);
-            $this->handleTranslatableFields($team, $data);
+            
             $this->handleStandardFields($team, $data);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:32:13
             $this->checkOptimisticLock($team, $data);
             $this->handleMoveIfNeeded($team, $data);
             $this->handleTranslatableFields($team, $data);
-            $this->handleStandardFields($team, $data);
+            
 
             $fresh = $team->fresh();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] InstanceOf_
Actions/Teams/UpdateTeam.php:35:13
             $this->handleStandardFields($team, $data);
 
             $fresh = $team->fresh();
-            throw_unless($fresh instanceof Team, RuntimeException::class, 'Team not found after update');
+            throw_unless(true, RuntimeException::class, 'Team not found after update');
 
             /** @var Team $fresh */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] InstanceOf_
Actions/Teams/UpdateTeam.php:35:13
             $this->handleStandardFields($team, $data);
 
             $fresh = $team->fresh();
-            throw_unless($fresh instanceof Team, RuntimeException::class, 'Team not found after update');
+            throw_unless(false, RuntimeException::class, 'Team not found after update');
 
             /** @var Team $fresh */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] NotIdentical
Actions/Teams/UpdateTeam.php:58:9
      */
     private function handleMoveIfNeeded(Team $team, array &$data): void
     {
-        if (array_key_exists('parent_id', $data) && $data['parent_id'] !== $team->parent_id) {
+        if (array_key_exists('parent_id', $data) && $data['parent_id'] === $team->parent_id) {
             $this->moveTeamAction->handle($team, $data['parent_id']);
             unset($data['parent_id']); // Remove so we don't double-update
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] LogicalAnd
Actions/Teams/UpdateTeam.php:58:9
      */
     private function handleMoveIfNeeded(Team $team, array &$data): void
     {
-        if (array_key_exists('parent_id', $data) && $data['parent_id'] !== $team->parent_id) {
+        if (array_key_exists('parent_id', $data) || $data['parent_id'] !== $team->parent_id) {
             $this->moveTeamAction->handle($team, $data['parent_id']);
             unset($data['parent_id']); // Remove so we don't double-update
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:72:13
         $locale = app()->getLocale();
 
         if (isset($data['name'])) {
-            $team->setTranslation('name', $locale, $data['name']);
+            
             $this->nameValidator->validateUnique($team);
             unset($data['name']);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:73:13
 
         if (isset($data['name'])) {
             $team->setTranslation('name', $locale, $data['name']);
-            $this->nameValidator->validateUnique($team);
+            
             unset($data['name']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:78:13
         }
 
         if (isset($data['bio'])) {
-            $team->setTranslation('bio', $locale, $data['bio']);
+            
             unset($data['bio']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] NotIdentical
Actions/Teams/UpdateTeam.php:88:9
      */
     private function handleStandardFields(Team $team, array $data): void
     {
-        if ($data !== []) {
+        if ($data === []) {
             $team->update($data);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.

[Killed] MethodCallRemoval
Actions/Teams/UpdateTeam.php:94:9
             return;
         }
 
-        $team->save();
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/EditTeamComponentTest.php" not found.
