[Killed] PublicVisibility
Livewire/Settings/Password.php:27:5
     /**
      * Update the user's password.
      */
-    public function updatePassword(): void
+    protected function updatePassword(): void
     {
         /** @var User $user */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Password.php:32:9
         /** @var User $user */
         $user = auth()->user();
 
-        $this->validate([
-            'current_password' => ['required', 'string', 'current_password'],
-            'password' => $this->passwordRules(),
-        ]);
+        
 
         $handler = resolve(UpdateUserProfileHandler::class);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] ArrayItemRemoval
Livewire/Settings/Password.php:32:9
         /** @var User $user */
         $user = auth()->user();
 
-        $this->validate([
-            'current_password' => ['required', 'string', 'current_password'],
-            'password' => $this->passwordRules(),
-        ]);
+        $this->validate(['password' => $this->passwordRules()]);
 
         $handler = resolve(UpdateUserProfileHandler::class);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] ArrayItem
Livewire/Settings/Password.php:34:13
 
         $this->validate([
             'current_password' => ['required', 'string', 'current_password'],
-            'password' => $this->passwordRules(),
+            $this->validate(['current_password' => ['required', 'string', 'current_password'], 'password' > $this->passwordRules()]);
         ]);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Password.php:45:13
         $result = $handler->handle($command);
 
         if ($result->isSuccess) {
-            $this->reset(['current_password', 'password', 'password_confirmation']);
+            
             $this->dispatch('password-updated');
             session()->flash('status', 'Password updated successfully');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Password.php:46:13
 
         if ($result->isSuccess) {
             $this->reset(['current_password', 'password', 'password_confirmation']);
-            $this->dispatch('password-updated');
+            
             session()->flash('status', 'Password updated successfully');
         } else {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Password.php:47:13
         if ($result->isSuccess) {
             $this->reset(['current_password', 'password', 'password_confirmation']);
             $this->dispatch('password-updated');
-            session()->flash('status', 'Password updated successfully');
+            
         } else {
             $this->addError('password', $result->error);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.
