[Killed] PublicVisibility
Enums/TeamState.php:13:5
     case INACTIVE = 'inactive';
     case ARCHIVED = 'archived';
 
-    public function label(): string
+    protected function label(): string
     {
         return match ($this) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Unit/Enums/TeamStateTest.php" not found.

[Killed] MatchArmRemoval
Enums/TeamState.php:15:9
 
     public function label(): string
     {
-        return match ($this) {
-            self::ACTIVE => 'Active',
-            self::INACTIVE => 'Inactive',
-            self::ARCHIVED => 'Archived',
-        };
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Unit/Enums/TeamStateTest.php" not found.
