[Killed] ReturnRemoval
Providers/AppServiceProvider.php:67:13
                 new CrossOrganisationRule($organisationFinder),
             ];
 
-            return new ApprovalDecisionEngine($rules);
+            
         });
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IncrementInteger
Providers/AppServiceProvider.php:167:9
      */
     private function getLocalPasswordRule(): Password
     {
-        return Password::min(8)
+        return Password::min(9)->letters()->numbers()->symbols()->mixedCase();
             ->letters()
             ->numbers()
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] DecrementInteger
Providers/AppServiceProvider.php:167:9
      */
     private function getLocalPasswordRule(): Password
     {
-        return Password::min(8)
+        return Password::min(7)->letters()->numbers()->symbols()->mixedCase();
             ->letters()
             ->numbers()
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] Identical
Providers/AppServiceProvider.php:217:17
          * @return null|true
          */
             static function ($user, $ability): ?bool {
-                if ($user === null) {
+                if ($user !== null) {
                     return null;
                 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] TrueValue
Providers/AppServiceProvider.php:223:21
 
                 // Check if user has any key role assigned
                 $hasKeyRole = $user->roles()
-                    ->where('is_key', true)
+                    $hasKeyRole = $user->roles()->where('is_key', false)->exists();
                     ->exists();
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] Ternary
Providers/AppServiceProvider.php:226:17
                     ->where('is_key', true)
                     ->exists();
 
-                return $hasKeyRole ? true : null;
+                return $hasKeyRole ? null : true;
             });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] TrueValue
Providers/AppServiceProvider.php:226:17
                     ->where('is_key', true)
                     ->exists();
 
-                return $hasKeyRole ? true : null;
+                return $hasKeyRole ? false : null;
             });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.
