[Killed] MatchArmRemoval
Enums/TeamStatus.php:16:9
 
     public function label(): string
     {
-        return match ($this) {
-            self::ONLINE => 'Online',
-            self::OFFLINE => 'Offline',
-            self::AWAY => 'Away',
-            self::BUSY => 'Busy',
-        };
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Unit/Enums/TeamStatusTest.php" not found.
