[Killed] MatchArmRemoval
Enums/TeamType.php:17:9
 
     public function label(): string
     {
-        return match ($this) {
-            self::ENTERPRISE => 'Enterprise',
-            self::ORGANISATION => 'Organisation',
-            self::DIVISION => 'Division',
-            self::DEPARTMENT => 'Department',
-            self::PROJECT => 'Project',
-        };
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Unit/Enums/TeamTypeTest.php" not found.
