[Killed] MatchArmRemoval
Enums/UserState.php:15:9
 
     public function label(): string
     {
-        return match ($this) {
-            self::PENDING => 'Pending',
-            self::ACTIVE => 'Active',
-            self::INACTIVE => 'Inactive',
-        };
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/UserStateTransitionsTest.php" not found.
