[Killed] ProtectedVisibility
Handlers/BaseHandler.php:29:5
      * @param  string  $message  Custom error message if not found
      * @return Result Success with model, or Failure if not found
      */
-    protected function ensureFound(mixed $model, string $message = 'Resource not found'): Result
+    private function ensureFound(mixed $model, string $message = 'Resource not found'): Result
     {
         if ($model === null) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Handlers/BaseHandler.php:31:9
      */
     protected function ensureFound(mixed $model, string $message = 'Resource not found'): Result
     {
-        if ($model === null) {
+        if ($model !== null) {
             return Result::failure($message, ['Lookup failed']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ProtectedVisibility
Handlers/BaseHandler.php:52:5
      *
      * @mago-expect Boolean parameter represents a validation condition, not a behavioral flag
      */
-    protected function guard(bool $condition, string $error): Result
+    private function guard(bool $condition, string $error): Result
     {
         if ($condition) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IfNegation
Handlers/BaseHandler.php:54:9
      */
     protected function guard(bool $condition, string $error): Result
     {
-        if ($condition) {
-            return Result::success(true);
-        }
+        if (!$condition) {
 
         return Result::failure($error, ["Guard failed: {$error}"]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Handlers/BaseHandler.php:55:13
     protected function guard(bool $condition, string $error): Result
     {
         if ($condition) {
-            return Result::success(true);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] TrueValue
Handlers/BaseHandler.php:55:13
     protected function guard(bool $condition, string $error): Result
     {
         if ($condition) {
-            return Result::success(true);
+            return Result::success(false);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
