[Killed] InstanceOf_
Handlers/Commands/Teams/CreateTeamHandler.php:43:9
     #[Override]
     public function handle(object $command): Result
     {
-        if (! $command instanceof CreateTeamCommand) {
+        if ($command instanceof CreateTeamCommand) {
             return Result::failure('Invalid command type', ['Expected CreateTeamCommand']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] ArrayItemRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:51:17
         try {
             return Result::try(
                 fn (): Team => DB::transaction(fn (): Team => $this->createTeam($command)),
-                ['Starting team creation']
+                return Result::try(fn(): Team => DB::transaction(fn(): Team => $this->createTeam($command)), []);
             );
         } catch (ValidationException $e) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] InstanceOf_
Handlers/Commands/Teams/CreateTeamHandler.php:75:9
     private function createTeam(CreateTeamCommand $command): Team
     {
         /** @var TeamType */
-        $type = $command->data['type'] instanceof TeamType
+        $type = !$command->data['type'] instanceof TeamType ? $command->data['type'] : TeamType::from((string) $command->data['type']);
             ? $command->data['type']
             : TeamType::from((string) $command->data['type']);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/CreateTeamHandler.php:75:9
     private function createTeam(CreateTeamCommand $command): Team
     {
         /** @var TeamType */
-        $type = $command->data['type'] instanceof TeamType
-            ? $command->data['type']
-            : TeamType::from((string) $command->data['type']);
+        $type = $command->data['type'] instanceof TeamType ? TeamType::from((string) $command->data['type']) : $command->data['type'];']);
 
         /** @var string|int|null $parentId */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/CreateTeamHandler.php:83:9
         $parentId = $command->data['parent_id'] ?? null;
 
         // Resolve Parent for tenant calculation (use withoutGlobalScopes to access parent)
-        $parent = $parentId !== null
-            ? Team::query()->withoutGlobalScopes()->find($parentId)
-            : null;
+        $parent = $parentId !== null ? null : Team::query()->withoutGlobalScopes()->find($parentId);
 
         // Validate hierarchy rules
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] Throw_
Handlers/Commands/Teams/CreateTeamHandler.php:90:13
         // Validate hierarchy rules
         $hierarchyResult = TeamHierarchyValidator::validate($type, $parent);
         if ($hierarchyResult->isFailure) {
-            throw ValidationException::withMessages([
-                'parent_id' => [$hierarchyResult->error],
-            ]);
+            ValidationException::withMessages(['parent_id' => [$hierarchyResult->error]]);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] ArrayItemRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:90:13
         // Validate hierarchy rules
         $hierarchyResult = TeamHierarchyValidator::validate($type, $parent);
         if ($hierarchyResult->isFailure) {
-            throw ValidationException::withMessages([
-                'parent_id' => [$hierarchyResult->error],
-            ]);
+            throw ValidationException::withMessages([]);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] ArrayItemRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:91:17
         $hierarchyResult = TeamHierarchyValidator::validate($type, $parent);
         if ($hierarchyResult->isFailure) {
             throw ValidationException::withMessages([
-                'parent_id' => [$hierarchyResult->error],
+                throw ValidationException::withMessages(['parent_id' => []]);
             ]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] CastInt
Handlers/Commands/Teams/CreateTeamHandler.php:97:9
 
         // Fire Verbs event - validates hierarchy rules via event's validate() method
         // If validation fails, EventNotValid exception is thrown and caught by Result::try()
-        $parentIdInt = $parentId !== null ? (int) $parentId : null;
+        $parentIdInt = $parentId !== null ? $parentId : null;
         $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
         $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/CreateTeamHandler.php:97:9
 
         // Fire Verbs event - validates hierarchy rules via event's validate() method
         // If validation fails, EventNotValid exception is thrown and caught by Result::try()
-        $parentIdInt = $parentId !== null ? (int) $parentId : null;
+        $parentIdInt = $parentId !== null ? null : (int) $parentId;
         $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
         $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] LogicalAnd
Handlers/Commands/Teams/CreateTeamHandler.php:98:9
         // Fire Verbs event - validates hierarchy rules via event's validate() method
         // If validation fails, EventNotValid exception is thrown and caught by Result::try()
         $parentIdInt = $parentId !== null ? (int) $parentId : null;
-        $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
+        $state = isset($command->data['state']) || is_string($command->data['state']) ? $command->data['state'] : null;
         $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Handlers/Commands/Teams/CreateTeamHandler.php:98:9
         // Fire Verbs event - validates hierarchy rules via event's validate() method
         // If validation fails, EventNotValid exception is thrown and caught by Result::try()
         $parentIdInt = $parentId !== null ? (int) $parentId : null;
-        $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
+        $state = isset($command->data['state']) && !is_string($command->data['state']) ? $command->data['state'] : null;
         $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Handlers/Commands/Teams/CreateTeamHandler.php:99:9
         // If validation fails, EventNotValid exception is thrown and caught by Result::try()
         $parentIdInt = $parentId !== null ? (int) $parentId : null;
         $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
-        $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
+        $status = !isset($command->data['status']) && !is_string($command->data['status']) ? $command->data['status'] : null;
 
         TeamCreated::fire(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] LogicalAndNegation
Handlers/Commands/Teams/CreateTeamHandler.php:99:9
         // If validation fails, EventNotValid exception is thrown and caught by Result::try()
         $parentIdInt = $parentId !== null ? (int) $parentId : null;
         $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
-        $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
+        $status = !(isset($command->data['status']) && is_string($command->data['status'])) ? $command->data['status'] : null;
 
         TeamCreated::fire(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:101:9
         $state = isset($command->data['state']) && is_string($command->data['state']) ? $command->data['state'] : null;
         $status = isset($command->data['status']) && is_string($command->data['status']) ? $command->data['status'] : null;
 
-        TeamCreated::fire(
-            type: $type,
-            name: $command->data['name'] ?? '',
-            bio: $command->data['bio'] ?? null,
-            parent_id: $parentIdInt,
-            tenant_id: null, // Will be calculated below or handled by projection
-            state: $state,
-            status: $status,
-        );
+        
 
         // Commit the event to persist it to verb_events table
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] Coalesce
Handlers/Commands/Teams/CreateTeamHandler.php:103:13
 
         TeamCreated::fire(
             type: $type,
-            name: $command->data['name'] ?? '',
+            name: '' ?? $command->data['name'],
             bio: $command->data['bio'] ?? null,
             parent_id: $parentIdInt,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:112:9
         );
 
         // Commit the event to persist it to verb_events table
-        Verbs::commit();
+        
 
         // Determine Tenant (Enterprise logic)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] NotIdentical
Handlers/Commands/Teams/CreateTeamHandler.php:116:9
 
         // Determine Tenant (Enterprise logic)
         $tenantId = null;
-        if ($parent !== null) {
+        if ($parent === null) {
             /** @var string|int|null $parentIdValue */
             $parentIdValue = $parent->getAttribute('id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/CreateTeamHandler.php:119:13
         if ($parent !== null) {
             /** @var string|int|null $parentIdValue */
             $parentIdValue = $parent->getAttribute('id');
-            $tenantId = $parent->type === TeamType::ENTERPRISE
-                ? $parentIdValue
-                : $parent->tenant_id;
+            $tenantId = $parent->type === TeamType::ENTERPRISE ? $parent->tenant_id : $parentIdValue;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] LogicalAndNegation
Handlers/Commands/Teams/CreateTeamHandler.php:124:9
                 : $parent->tenant_id;
         }
 
-        if (! $parent && $type === TeamType::ENTERPRISE) {
+        if (!(!$parent && $type === TeamType::ENTERPRISE)) {
             $tenantId = null; // Will be set to self ID after creation
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] LogicalNot
Handlers/Commands/Teams/CreateTeamHandler.php:124:9
                 : $parent->tenant_id;
         }
 
-        if (! $parent && $type === TeamType::ENTERPRISE) {
+        if ($parent && $type === TeamType::ENTERPRISE) {
             $tenantId = null; // Will be set to self ID after creation
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] SpreadRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:131:13
         // Create team (observer will validate hierarchy and unique name)
         // ValidationException from model events will be caught by Result::try() wrapper
         $team = Team::query()->create([
-            ...$command->data,
+            $team = Team::query()->create([$command->data, 'tenant_id' => $tenantId]);
             'tenant_id' => $tenantId,
         ]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] SpreadOneItem
Handlers/Commands/Teams/CreateTeamHandler.php:131:13
         // Create team (observer will validate hierarchy and unique name)
         // ValidationException from model events will be caught by Result::try() wrapper
         $team = Team::query()->create([
-            ...$command->data,
+            $team = Team::query()->create([[...$command->data][0], 'tenant_id' => $tenantId]);
             'tenant_id' => $tenantId,
         ]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/CreateTeamHandler.php:139:13
         if ($type === TeamType::ENTERPRISE) {
             /** @var string|int $teamId */
             $teamId = $team->getAttribute('id');
-            $team->updateQuietly(['tenant_id' => $teamId]);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.
