[Killed] InstanceOf_
Handlers/Commands/Teams/MoveTeamHandler.php:33:9
     #[Override]
     public function handle(object $command): Result
     {
-        if (! $command instanceof MoveTeamCommand) {
+        if ($command instanceof MoveTeamCommand) {
             return Result::failure('Invalid command type', ['Expected MoveTeamCommand']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Handlers/Commands/Teams/MoveTeamHandler.php:38:9
         }
 
         // Early return if no move needed
-        if ($command->team->parent_id === $command->newParentId) {
+        if ($command->team->parent_id !== $command->newParentId) {
             return Result::success($command->team, ['No move needed - parent unchanged']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/MoveTeamHandler.php:42:9
             return Result::success($command->team, ['No move needed - parent unchanged']);
         }
 
-        $newParent = $command->newParentId !== null
-            ? Team::query()->withoutGlobalScopes()->find($command->newParentId)
-            : null;
+        $newParent = $command->newParentId !== null ? null : Team::query()->withoutGlobalScopes()->find($command->newParentId);
 
         // Validate hierarchy rules using flatMap
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Handlers/Commands/Teams/MoveTeamHandler.php:52:21
                 // Validate no cycle would be created using guard()
 
                 fn (): Result => $this->guard(
-                    ! ($newParent instanceof Team && $newParent->isDescendantOf($command->team)),
+                    fn(): Result => $this->guard(!($newParent instanceof Team && !$newParent->isDescendantOf($command->team)), 'Cannot move a team into its own descendant.')->flatMap(
                     'Cannot move a team into its own descendant.'
                 )->flatMap(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalNot
Handlers/Commands/Teams/MoveTeamHandler.php:52:21
                 // Validate no cycle would be created using guard()
 
                 fn (): Result => $this->guard(
-                    ! ($newParent instanceof Team && $newParent->isDescendantOf($command->team)),
+                    fn(): Result => $this->guard($newParent instanceof Team && $newParent->isDescendantOf($command->team), 'Cannot move a team into its own descendant.')->flatMap(
                     'Cannot move a team into its own descendant.'
                 )->flatMap(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Handlers/Commands/Teams/MoveTeamHandler.php:59:25
 
                     fn (): Result => Result::try(
                         fn (): Team => DB::transaction(fn (): Team => $this->moveTeam($command, $newParent)),
-                        ['Executing team move']
+                        fn(): Result => Result::try(fn(): Team => DB::transaction(fn(): Team => $this->moveTeam($command, $newParent)), [])->flatMap(
                     )->flatMap(
                         // Ensure team was found after move
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/MoveTeamHandler.php:63:25
                     )->flatMap(
                         // Ensure team was found after move
 
-                        fn (mixed $team): Result => $this->ensureFound($team instanceof Team ? $team : throw new RuntimeException('Invalid team type'), 'Team not found after move'))));
+                        fn(mixed $team): Result => $this->ensureFound($team instanceof Team ? throw new RuntimeException('Invalid team type') : $team, 'Team not found after move')
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Handlers/Commands/Teams/MoveTeamHandler.php:63:25
                     )->flatMap(
                         // Ensure team was found after move
 
-                        fn (mixed $team): Result => $this->ensureFound($team instanceof Team ? $team : throw new RuntimeException('Invalid team type'), 'Team not found after move'))));
+                        fn(mixed $team): Result => $this->ensureFound(!$team instanceof Team ? $team : throw new RuntimeException('Invalid team type'), 'Team not found after move')
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/MoveTeamHandler.php:72:9
     private function moveTeam(MoveTeamCommand $command, ?Team $newParent): Team
     {
         $oldTenantId = (string) $command->team->tenant_id;
-        $command->team->parent_id = $command->newParentId !== null ? (string) $command->newParentId : null;
+        $command->team->parent_id = $command->newParentId !== null ? null : (string) $command->newParentId;
         $command->team->tenant_id = $this->calculateNewTenantId($command->team, $newParent);
         $command->team->saveQuietly(); // Avoid triggering observers
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/MoveTeamHandler.php:74:9
         $oldTenantId = (string) $command->team->tenant_id;
         $command->team->parent_id = $command->newParentId !== null ? (string) $command->newParentId : null;
         $command->team->tenant_id = $this->calculateNewTenantId($command->team, $newParent);
-        $command->team->saveQuietly(); // Avoid triggering observers
+         // Avoid triggering observers
 
         $this->propagateTenantChange($command->team, $oldTenantId);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/MoveTeamHandler.php:76:9
         $command->team->tenant_id = $this->calculateNewTenantId($command->team, $newParent);
         $command->team->saveQuietly(); // Avoid triggering observers
 
-        $this->propagateTenantChange($command->team, $oldTenantId);
+        
 
         $fresh = $command->team->fresh();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Handlers/Commands/Teams/MoveTeamHandler.php:89:9
      */
     private function calculateNewTenantId(Team $team, ?Team $newParent): string
     {
-        if ($newParent instanceof Team) {
+        if (!$newParent instanceof Team) {
             return $newParent->type === TeamType::ENTERPRISE
                 ? (string) $newParent->id
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Handlers/Commands/Teams/MoveTeamHandler.php:90:13
     private function calculateNewTenantId(Team $team, ?Team $newParent): string
     {
         if ($newParent instanceof Team) {
-            return $newParent->type === TeamType::ENTERPRISE
-                ? (string) $newParent->id
-                : (string) $newParent->tenant_id;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Handlers/Commands/Teams/MoveTeamHandler.php:90:13
     private function calculateNewTenantId(Team $team, ?Team $newParent): string
     {
         if ($newParent instanceof Team) {
-            return $newParent->type === TeamType::ENTERPRISE
-                ? (string) $newParent->id
-                : (string) $newParent->tenant_id;
+            return $newParent->type === TeamType::ENTERPRISE ? (string) $newParent->tenant_id : (string) $newParent->id;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] CastString
Handlers/Commands/Teams/MoveTeamHandler.php:92:17
         if ($newParent instanceof Team) {
             return $newParent->type === TeamType::ENTERPRISE
                 ? (string) $newParent->id
-                : (string) $newParent->tenant_id;
+                return $newParent->type === TeamType::ENTERPRISE ? (string) $newParent->id : $newParent->tenant_id;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] NotIdentical
Handlers/Commands/Teams/MoveTeamHandler.php:108:9
      */
     private function propagateTenantChange(Team $team, string $oldTenantId): void
     {
-        if ($team->tenant_id !== $oldTenantId) {
+        if ($team->tenant_id === $oldTenantId) {
             $team->updateDescendantTenants((string) $team->tenant_id);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/MoveTeamHandler.php:109:13
     private function propagateTenantChange(Team $team, string $oldTenantId): void
     {
         if ($team->tenant_id !== $oldTenantId) {
-            $team->updateDescendantTenants((string) $team->tenant_id);
+            
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
