[Killed] LogicalNot
Handlers/Commands/Teams/UpdateTeamHandler.php:38:9
     #[Override]
     public function handle(object $command): Result
     {
-        if (! $command instanceof UpdateTeamCommand) {
+        if ($command instanceof UpdateTeamCommand) {
             return Result::failure('Invalid command type', ['Expected UpdateTeamCommand']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/UpdateTeamHandler.php:57:25
                     ->flatMap(function (mixed $data) use ($command): Result {
                         assert(is_array($data), 'Data must be an array');
                         // Handle standard fields and save
-                        $this->handleStandardFields($command->team, $data);
+                        
 
                         // Ensure team was found after update
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] LogicalNot
Handlers/Commands/Teams/UpdateTeamHandler.php:75:9
      */
     private function checkOptimisticLock(Team $team, array $data): Result
     {
-        if (! isset($data['lock_version'])) {
+        if (isset($data['lock_version'])) {
             return Result::success(true, ['No lock version provided']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] CastInt
Handlers/Commands/Teams/UpdateTeamHandler.php:80:9
         }
 
         $lockVersion = $data['lock_version'];
-        $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
+        $currentDbVersion = DB::table('teams')->where('id', $team->id)->value('lock_version');
         $providedVersion = is_numeric($lockVersion) ? (int) $lockVersion : throw new InvalidArgumentException('lock_version must be numeric');
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Throw_
Handlers/Commands/Teams/UpdateTeamHandler.php:81:9
 
         $lockVersion = $data['lock_version'];
         $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
-        $providedVersion = is_numeric($lockVersion) ? (int) $lockVersion : throw new InvalidArgumentException('lock_version must be numeric');
+        $providedVersion = is_numeric($lockVersion) ? (int) $lockVersion : new InvalidArgumentException('lock_version must be numeric');
 
         return $this->guard(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] CastInt
Handlers/Commands/Teams/UpdateTeamHandler.php:81:9
 
         $lockVersion = $data['lock_version'];
         $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
-        $providedVersion = is_numeric($lockVersion) ? (int) $lockVersion : throw new InvalidArgumentException('lock_version must be numeric');
+        $providedVersion = is_numeric($lockVersion) ? $lockVersion : throw new InvalidArgumentException('lock_version must be numeric');
 
         return $this->guard(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Identical
Handlers/Commands/Teams/UpdateTeamHandler.php:84:13
         $providedVersion = is_numeric($lockVersion) ? (int) $lockVersion : throw new InvalidArgumentException('lock_version must be numeric');
 
         return $this->guard(
-            $currentDbVersion === $providedVersion,
+            return $this->guard($currentDbVersion !== $providedVersion, 'Optimistic locking failed: version mismatch');
             'Optimistic locking failed: version mismatch'
         );
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] LogicalOrAllSubExprNegation
Handlers/Commands/Teams/UpdateTeamHandler.php:97:9
      */
     private function handleMoveIfNeeded(UpdateTeamCommand $command, array $data): Result
     {
-        if (! array_key_exists('parent_id', $data) || $data['parent_id'] === $command->team->parent_id) {
+        if (array_key_exists('parent_id', $data) || !($data['parent_id'] === $command->team->parent_id)) {
             return Result::success($data, ['No move needed']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] LogicalOrNegation
Handlers/Commands/Teams/UpdateTeamHandler.php:97:9
      */
     private function handleMoveIfNeeded(UpdateTeamCommand $command, array $data): Result
     {
-        if (! array_key_exists('parent_id', $data) || $data['parent_id'] === $command->team->parent_id) {
+        if (!(!array_key_exists('parent_id', $data) || $data['parent_id'] === $command->team->parent_id)) {
             return Result::success($data, ['No move needed']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ReturnRemoval
Handlers/Commands/Teams/UpdateTeamHandler.php:98:13
     private function handleMoveIfNeeded(UpdateTeamCommand $command, array $data): Result
     {
         if (! array_key_exists('parent_id', $data) || $data['parent_id'] === $command->team->parent_id) {
-            return Result::success($data, ['No move needed']);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ArrayItemRemoval
Handlers/Commands/Teams/UpdateTeamHandler.php:98:13
     private function handleMoveIfNeeded(UpdateTeamCommand $command, array $data): Result
     {
         if (! array_key_exists('parent_id', $data) || $data['parent_id'] === $command->team->parent_id) {
-            return Result::success($data, ['No move needed']);
+            return Result::success($data, []);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ReturnRemoval
Handlers/Commands/Teams/UpdateTeamHandler.php:140:21
                         unset($data['bio']);
                     }
 
-                    return Result::success($data, ['Translatable fields handled']);
+                    
                 });
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Teams/UpdateTeamHandler.php:160:13
     private function handleStandardFields(Team $team, array $data): void
     {
         if ($data !== []) {
-            $team->update($data);
+            
 
             return;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ReturnRemoval
Handlers/Commands/Teams/UpdateTeamHandler.php:162:13
         if ($data !== []) {
             $team->update($data);
 
-            return;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.
