[Killed] InstanceOf_
Handlers/Commands/Users/RegisterUserHandler.php:33:9
     #[Override]
     public function handle(object $command): Result
     {
-        if (! $command instanceof RegisterUserCommand) {
+        if ($command instanceof RegisterUserCommand) {
             return Result::failure('Invalid command type', ['Expected RegisterUserCommand']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] LogicalNot
Handlers/Commands/Users/RegisterUserHandler.php:64:9
      */
     private function setBioIfProvided(User $user, RegisterUserCommand $command): Result
     {
-        if (! isset($command->data['bio'])) {
+        if (isset($command->data['bio'])) {
             return Result::success($user->fresh(), ['User registered without bio']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] ReturnRemoval
Handlers/Commands/Users/RegisterUserHandler.php:65:13
     private function setBioIfProvided(User $user, RegisterUserCommand $command): Result
     {
         if (! isset($command->data['bio'])) {
-            return Result::success($user->fresh(), ['User registered without bio']);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.
