[Killed] InstanceOf_
Handlers/Commands/Users/UpdateUserProfileHandler.php:33:9
     #[Override]
     public function handle(object $command): Result
     {
-        if (! $command instanceof UpdateUserProfileCommand) {
+        if ($command instanceof UpdateUserProfileCommand) {
             return Result::failure('Invalid command type', ['Expected UpdateUserProfileCommand']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalAndNegation
Handlers/Commands/Users/UpdateUserProfileHandler.php:70:13
 
         // Handle email_verified_at reset if email changed
         $shouldResetEmailVerification =
-            array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null;
+            $shouldResetEmailVerification = !(array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null);
         $emailChanged = isset($data['email']) && $command->user->email !== $data['email'];
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Handlers/Commands/Users/UpdateUserProfileHandler.php:70:13
 
         // Handle email_verified_at reset if email changed
         $shouldResetEmailVerification =
-            array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null;
+            $shouldResetEmailVerification = !array_key_exists('email_verified_at', $data) && !($data['email_verified_at'] === null);
         $emailChanged = isset($data['email']) && $command->user->email !== $data['email'];
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalAndNegation
Handlers/Commands/Users/UpdateUserProfileHandler.php:71:9
         // Handle email_verified_at reset if email changed
         $shouldResetEmailVerification =
             array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null;
-        $emailChanged = isset($data['email']) && $command->user->email !== $data['email'];
+        $emailChanged = !(isset($data['email']) && $command->user->email !== $data['email']);
 
         if ($shouldResetEmailVerification || $emailChanged) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] NotIdentical
Handlers/Commands/Users/UpdateUserProfileHandler.php:71:9
         // Handle email_verified_at reset if email changed
         $shouldResetEmailVerification =
             array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null;
-        $emailChanged = isset($data['email']) && $command->user->email !== $data['email'];
+        $emailChanged = isset($data['email']) && $command->user->email === $data['email'];
 
         if ($shouldResetEmailVerification || $emailChanged) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalOrSingleSubExprNegation
Handlers/Commands/Users/UpdateUserProfileHandler.php:73:9
             array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null;
         $emailChanged = isset($data['email']) && $command->user->email !== $data['email'];
 
-        if ($shouldResetEmailVerification || $emailChanged) {
+        if (!$shouldResetEmailVerification || $emailChanged) {
             unset($data['email_verified_at']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalOr
Handlers/Commands/Users/UpdateUserProfileHandler.php:73:9
             array_key_exists('email_verified_at', $data) && $data['email_verified_at'] === null;
         $emailChanged = isset($data['email']) && $command->user->email !== $data['email'];
 
-        if ($shouldResetEmailVerification || $emailChanged) {
+        if ($shouldResetEmailVerification && $emailChanged) {
             unset($data['email_verified_at']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] NotIdentical
Handlers/Commands/Users/UpdateUserProfileHandler.php:78:9
         }
 
         // Update other fields
-        if ($data !== []) {
+        if ($data === []) {
             $command->user->update($data);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Users/UpdateUserProfileHandler.php:79:13
 
         // Update other fields
         if ($data !== []) {
-            $command->user->update($data);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalOrSingleSubExprNegation
Handlers/Commands/Users/UpdateUserProfileHandler.php:83:9
         }
 
         // Reset email verification if email changed
-        if ($shouldResetEmailVerification || $emailChanged) {
+        if ($shouldResetEmailVerification || !$emailChanged) {
             $command->user->email_verified_at = null;
             $command->user->save();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] LogicalOr
Handlers/Commands/Users/UpdateUserProfileHandler.php:83:9
         }
 
         // Reset email verification if email changed
-        if ($shouldResetEmailVerification || $emailChanged) {
+        if ($shouldResetEmailVerification && $emailChanged) {
             $command->user->email_verified_at = null;
             $command->user->save();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] MethodCallRemoval
Handlers/Commands/Users/UpdateUserProfileHandler.php:85:13
         // Reset email verification if email changed
         if ($shouldResetEmailVerification || $emailChanged) {
             $command->user->email_verified_at = null;
-            $command->user->save();
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] FunctionCallRemoval
Handlers/Commands/Users/UpdateUserProfileHandler.php:89:9
         }
 
         $fresh = $command->user->fresh();
-        throw_unless($fresh instanceof User, RuntimeException::class, 'User not found after update');
+        
 
         return $fresh;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.

[Killed] InstanceOf_
Handlers/Commands/Users/UpdateUserProfileHandler.php:89:9
         }
 
         $fresh = $command->user->fresh();
-        throw_unless($fresh instanceof User, RuntimeException::class, 'User not found after update');
+        throw_unless(true, RuntimeException::class, 'User not found after update');
 
         return $fresh;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/PasswordUpdateTest.php" not found.
