[Killed] PublicVisibility
Http/Controllers/Teams/BulkTeamController.php:30:5
      *
      * Uses collection pipeline with partition for functional approach.
      */
-    public function store(BulkTeamRequest $request): JsonResponse
+    protected function store(BulkTeamRequest $request): JsonResponse
     {
         $teams = collect($request->getTeams());
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] DecrementInteger
Http/Controllers/Teams/BulkTeamController.php:37:9
 
         // Validate batch size
         /** @var int $maxBatchSize */
-        $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 500;
+        $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 499;
         if ($teams->count() > $maxBatchSize) {
             return response()->json([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Coalesce
Http/Controllers/Teams/BulkTeamController.php:37:9
 
         // Validate batch size
         /** @var int $maxBatchSize */
-        $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 500;
+        $maxBatchSize = 500 ?? $enterprise->bulk_operation_batch_size;
         if ($teams->count() > $maxBatchSize) {
             return response()->json([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] GreaterThanNegotiation
Http/Controllers/Teams/BulkTeamController.php:38:9
         // Validate batch size
         /** @var int $maxBatchSize */
         $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 500;
-        if ($teams->count() > $maxBatchSize) {
+        if ($teams->count() <= $maxBatchSize) {
             return response()->json([
                 'success' => false,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] GreaterThan
Http/Controllers/Teams/BulkTeamController.php:38:9
         // Validate batch size
         /** @var int $maxBatchSize */
         $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 500;
-        if ($teams->count() > $maxBatchSize) {
+        if ($teams->count() >= $maxBatchSize) {
             return response()->json([
                 'success' => false,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ReturnRemoval
Http/Controllers/Teams/BulkTeamController.php:39:13
         /** @var int $maxBatchSize */
         $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 500;
         if ($teams->count() > $maxBatchSize) {
-            return response()->json([
-                'success' => false,
-                'error' => "Batch size exceeds maximum allowed ({$maxBatchSize}).",
-            ], 422);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] FalseValue
Http/Controllers/Teams/BulkTeamController.php:40:17
         $maxBatchSize = $enterprise->bulk_operation_batch_size ?? 500;
         if ($teams->count() > $maxBatchSize) {
             return response()->json([
-                'success' => false,
+                return response()->json(['success' => true, 'error' => "Batch size exceeds maximum allowed ({$maxBatchSize})."], 422);
                 'error' => "Batch size exceeds maximum allowed ({$maxBatchSize}).",
             ], 422);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] IncrementInteger
Http/Controllers/Teams/BulkTeamController.php:42:13
             return response()->json([
                 'success' => false,
                 'error' => "Batch size exceeds maximum allowed ({$maxBatchSize}).",
-            ], 422);
+            return response()->json(['success' => false, 'error' => "Batch size exceeds maximum allowed ({$maxBatchSize})."], 423);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] DecrementInteger
Http/Controllers/Teams/BulkTeamController.php:42:13
             return response()->json([
                 'success' => false,
                 'error' => "Batch size exceeds maximum allowed ({$maxBatchSize}).",
-            ], 422);
+            return response()->json(['success' => false, 'error' => "Batch size exceeds maximum allowed ({$maxBatchSize})."], 421);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] FalseValue
Http/Controllers/Teams/BulkTeamController.php:52:13
             ->values();
 
         $partitioned = $results->partition(
-            static fn ($result): bool => ($result['success'] ?? false) === true
+            $partitioned = $results->partition(static fn($result): bool => ($result['success'] ?? true) === true);
         );
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Coalesce
Http/Controllers/Teams/BulkTeamController.php:52:13
             ->values();
 
         $partitioned = $results->partition(
-            static fn ($result): bool => ($result['success'] ?? false) === true
+            $partitioned = $results->partition(static fn($result): bool => (false ?? $result['success']) === true);
         );
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] DecrementInteger
Http/Controllers/Teams/BulkTeamController.php:56:9
         );
 
         /** @var Collection<int, array<string, mixed>> $successes */
-        $successes = $partitioned->get(0);
+        $successes = $partitioned->get(-1);
         /** @var Collection<int, array<string, mixed>> $failures */
         $failures = $partitioned->get(1);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] IncrementInteger
Http/Controllers/Teams/BulkTeamController.php:56:9
         );
 
         /** @var Collection<int, array<string, mixed>> $successes */
-        $successes = $partitioned->get(0);
+        $successes = $partitioned->get(1);
         /** @var Collection<int, array<string, mixed>> $failures */
         $failures = $partitioned->get(1);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] DecrementInteger
Http/Controllers/Teams/BulkTeamController.php:58:9
         /** @var Collection<int, array<string, mixed>> $successes */
         $successes = $partitioned->get(0);
         /** @var Collection<int, array<string, mixed>> $failures */
-        $failures = $partitioned->get(1);
+        $failures = $partitioned->get(0);
 
         $successCount = $successes->count();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] IncrementInteger
Http/Controllers/Teams/BulkTeamController.php:58:9
         /** @var Collection<int, array<string, mixed>> $successes */
         $successes = $partitioned->get(0);
         /** @var Collection<int, array<string, mixed>> $failures */
-        $failures = $partitioned->get(1);
+        $failures = $partitioned->get(2);
 
         $successCount = $successes->count();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] MatchArmRemoval
Http/Controllers/Teams/BulkTeamController.php:64:9
         $failureCount = $failures->count();
         $total = $teams->count();
 
-        $statusCode = match (true) {
-            $failureCount === 0 => 200, // All succeeded
-            $successCount === 0 => 422, // All failed
-            default => 207, // Partial success (Multi-Status)
-        };
+        
 
         return response()->json([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] IncrementInteger
Http/Controllers/Teams/BulkTeamController.php:65:13
         $total = $teams->count();
 
         $statusCode = match (true) {
-            $failureCount === 0 => 200, // All succeeded
+            $failureCount === 0 => 201,
             $successCount === 0 => 422, // All failed
             default => 207, // Partial success (Multi-Status)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Identical
Http/Controllers/Teams/BulkTeamController.php:65:13
         $total = $teams->count();
 
         $statusCode = match (true) {
-            $failureCount === 0 => 200, // All succeeded
+            $failureCount !== 0 => 200,
             $successCount === 0 => 422, // All failed
             default => 207, // Partial success (Multi-Status)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] DecrementInteger
Http/Controllers/Teams/BulkTeamController.php:66:13
 
         $statusCode = match (true) {
             $failureCount === 0 => 200, // All succeeded
-            $successCount === 0 => 422, // All failed
+            $successCount === 0 => 421,
             default => 207, // Partial success (Multi-Status)
         };
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Identical
Http/Controllers/Teams/BulkTeamController.php:66:13
 
         $statusCode = match (true) {
             $failureCount === 0 => 200, // All succeeded
-            $successCount === 0 => 422, // All failed
+            $successCount !== 0 => 422,
             default => 207, // Partial success (Multi-Status)
         };
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] IncrementInteger
Http/Controllers/Teams/BulkTeamController.php:67:13
         $statusCode = match (true) {
             $failureCount === 0 => 200, // All succeeded
             $successCount === 0 => 422, // All failed
-            default => 207, // Partial success (Multi-Status)
+            default => 208,
         };
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] DecrementInteger
Http/Controllers/Teams/BulkTeamController.php:67:13
         $statusCode = match (true) {
             $failureCount === 0 => 200, // All succeeded
             $successCount === 0 => 422, // All failed
-            default => 207, // Partial success (Multi-Status)
+            default => 206,
         };
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ArrayItemRemoval
Http/Controllers/Teams/BulkTeamController.php:70:9
             default => 207, // Partial success (Multi-Status)
         };
 
-        return response()->json([
-            'success' => $successCount > 0,
-            'total' => $total,
-            'success_count' => $successCount,
-            'failure_count' => $failureCount,
-            'results' => $results->all(),
-        ], $statusCode);
+        return response()->json(['total' => $total, 'success_count' => $successCount, 'failure_count' => $failureCount, 'results' => $results->all()], $statusCode);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] ArrayItem
Http/Controllers/Teams/BulkTeamController.php:75:13
             'total' => $total,
             'success_count' => $successCount,
             'failure_count' => $failureCount,
-            'results' => $results->all(),
+            return response()->json(['success' => $successCount > 0, 'total' => $total, 'success_count' => $successCount, 'failure_count' => $failureCount, 'results' > $results->all()], $statusCode);
         ], $statusCode);
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] InstanceOf_
Http/Controllers/Teams/BulkTeamController.php:102:13
             // Update existing team
             /** @var Team|null $team */
             $team = Team::query()->find($teamData['id']);
-            if (! $team instanceof Team) {
+            if ($team instanceof Team) {
                 return [
                     'index' => $index,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] LogicalOrNegation
Http/Controllers/Teams/BulkTeamController.php:181:9
     {
         $user = Auth::user();
 
-        abort_if(! $user || ! $user->tenant_id, 403, 'User must have a tenant.');
+        abort_if(!(!$user || !$user->tenant_id), 403, 'User must have a tenant.');
 
         /** @var Team|null $enterprise */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] LogicalOrAllSubExprNegation
Http/Controllers/Teams/BulkTeamController.php:181:9
     {
         $user = Auth::user();
 
-        abort_if(! $user || ! $user->tenant_id, 403, 'User must have a tenant.');
+        abort_if($user || $user->tenant_id, 403, 'User must have a tenant.');
 
         /** @var Team|null $enterprise */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] InstanceOf_
Http/Controllers/Teams/BulkTeamController.php:186:9
         /** @var Team|null $enterprise */
         $enterprise = Team::query()->find($user->tenant_id);
 
-        abort_unless($enterprise instanceof Team, 404, 'Enterprise not found.');
+        abort_unless(false, 404, 'Enterprise not found.');
 
         return $enterprise;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] FunctionCallRemoval
Http/Controllers/Teams/BulkTeamController.php:186:9
         /** @var Team|null $enterprise */
         $enterprise = Team::query()->find($user->tenant_id);
 
-        abort_unless($enterprise instanceof Team, 404, 'Enterprise not found.');
+        
 
         return $enterprise;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.
