[Killed] PublicVisibility
Http/Requests/BulkTeamRequest.php:24:5
      *
      * @return array<string, mixed>
      */
-    public function rules(): array
+    protected function rules(): array
     {
         return [
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] PublicVisibility
Http/Requests/BulkTeamRequest.php:50:5
      *
      * @return array<int, array<string, mixed>>
      */
-    public function getTeams(): array
+    protected function getTeams(): array
     {
         /** @var array<string, mixed> $validated */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.

[Killed] Coalesce
Http/Requests/BulkTeamRequest.php:55:9
         /** @var array<string, mixed> $validated */
         $validated = $this->validated();
 
-        return $validated['teams'] ?? [];
+        return [] ?? $validated['teams'];
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/BulkTeamOperationsTest.php" not found.
