[Killed] ArrayItemRemoval
Http/Requests/StoreTeamRequest.php:22:9
      */
     public function rules(): array
     {
-        return [
-            'name' => ['required'],
-            'type' => ['required', new Enum(TeamType::class)],
-            'parent_id' => ['nullable', 'exists:teams,id'],
-            'bio' => ['nullable', 'string', 'max:10000'], // Soft limit: 10,000 characters (tenant-configurable default, hard limit 50K)
-        ];
+        return ['type' => ['required', new Enum(TeamType::class)], 'parent_id' => ['nullable', 'exists:teams,id'], 'bio' => ['nullable', 'string', 'max:10000']];
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] ArrayItemRemoval
Http/Requests/StoreTeamRequest.php:23:13
     public function rules(): array
     {
         return [
-            'name' => ['required'],
+            return ['name' => [], 'type' => ['required', new Enum(TeamType::class)], 'parent_id' => ['nullable', 'exists:teams,id'], 'bio' => ['nullable', 'string', 'max:10000']];
             'type' => ['required', new Enum(TeamType::class)],
             'parent_id' => ['nullable', 'exists:teams,id'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.
