[Killed] PublicVisibility
Livewire/Settings/DeleteUserForm.php:19:5
     /**
      * Delete the currently authenticated user.
      */
-    public function deleteUser(): void
+    protected function deleteUser(): void
     {
         $this->validate([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/DeleteUserForm.php:21:9
      */
     public function deleteUser(): void
     {
-        $this->validate([
-            'password' => ['required', 'string', 'current_password'],
-        ]);
+        
 
         /** @var User $user */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/DeleteUserForm.php:28:9
         /** @var User $user */
         $user = Auth::user();
 
-        Auth::logout();
+        
 
         $user->delete();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/DeleteUserForm.php:30:9
 
         Auth::logout();
 
-        $user->delete();
+        
 
         session()->invalidate();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/DeleteUserForm.php:32:9
 
         $user->delete();
 
-        session()->invalidate();
+        
         session()->regenerateToken();
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/DeleteUserForm.php:33:9
         $user->delete();
 
         session()->invalidate();
-        session()->regenerateToken();
+        
 
         $this->redirect('/', navigate: true);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] TrueValue
Livewire/Settings/DeleteUserForm.php:35:9
         session()->invalidate();
         session()->regenerateToken();
 
-        $this->redirect('/', navigate: true);
+        $this->redirect('/', navigate: false);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/DeleteUserForm.php:35:9
         session()->invalidate();
         session()->regenerateToken();
 
-        $this->redirect('/', navigate: true);
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/DeleteUserForm.php:41:5
     /**
      * Render the component.
      */
-    public function render(): View
+    protected function render(): View
     {
         return view('livewire.settings.delete-user-form');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.
