[Killed] PublicVisibility
Livewire/Settings/Profile.php:22:5
     /**
      * Initialize the component.
      */
-    public function mount(): void
+    protected function mount(): void
     {
         /** @var User $user */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/Profile.php:33:5
     /**
      * Update the user's profile information.
      */
-    public function updateProfileInformation(): void
+    protected function updateProfileInformation(): void
     {
         /** @var User $user */
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Profile.php:38:9
         /** @var User $user */
         $user = auth()->user();
 
-        $this->validate([
-            'name' => ['required', 'string', 'max:255'],
-            'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,'.$user->id],
-        ]);
+        
 
         $handler = resolve(UpdateUserProfileHandler::class);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] ArrayItemRemoval
Livewire/Settings/Profile.php:39:13
         $user = auth()->user();
 
         $this->validate([
-            'name' => ['required', 'string', 'max:255'],
+            $this->validate(['name' => ['string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,' . $user->id]]);
             'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,'.$user->id],
         ]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] ConcatOperandRemoval
Livewire/Settings/Profile.php:40:13
 
         $this->validate([
             'name' => ['required', 'string', 'max:255'],
-            'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,'.$user->id],
+            $this->validate(['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', $user->id]]);
         ]);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] ConcatOperandRemoval
Livewire/Settings/Profile.php:40:13
 
         $this->validate([
             'name' => ['required', 'string', 'max:255'],
-            'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,'.$user->id],
+            $this->validate(['name' => ['required', 'string', 'max:255'], 'email' => ['required', 'string', 'email', 'max:255', 'unique:users,email,']]);
         ]);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Profile.php:52:13
         $result = $handler->handle($command);
 
         if ($result->isSuccess) {
-            $this->dispatch('profile-updated');
+            
             session()->flash('status', 'Profile updated successfully');
         } else {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.

[Killed] MethodCallRemoval
Livewire/Settings/Profile.php:53:13
 
         if ($result->isSuccess) {
             $this->dispatch('profile-updated');
-            session()->flash('status', 'Profile updated successfully');
+            
         } else {
             $this->addError('email', $result->error);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/ProfileUpdateTest.php" not found.
