[Killed] IncrementInteger
Livewire/Settings/TwoFactor.php:38:9
      */
     public function mount(): void
     {
-        abort_unless(Features::canManageTwoFactorAuthentication(), 403);
+        abort_unless(Features::canManageTwoFactorAuthentication(), 404);
 
         $user = auth()->user();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] FunctionCallRemoval
Livewire/Settings/TwoFactor.php:38:9
      */
     public function mount(): void
     {
-        abort_unless(Features::canManageTwoFactorAuthentication(), 403);
+        
 
         $user = auth()->user();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Livewire/Settings/TwoFactor.php:42:9
 
         $user = auth()->user();
 
-        if (Features::optionEnabled(Features::twoFactorAuthentication(), 'confirm') &&
-            $user->two_factor_secret &&
-            is_null($user->two_factor_confirmed_at)) {
+        if (!Features::optionEnabled(Features::twoFactorAuthentication(), 'confirm') && !$user->two_factor_secret && !is_null($user->two_factor_confirmed_at)) {
             // Confirmation was abandoned, disable 2FA
             resolve(DisableTwoFactorAuthentication::class)($user);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Livewire/Settings/TwoFactor.php:42:9
 
         $user = auth()->user();
 
-        if (Features::optionEnabled(Features::twoFactorAuthentication(), 'confirm') &&
-            $user->two_factor_secret &&
-            is_null($user->two_factor_confirmed_at)) {
+        if (!Features::optionEnabled(Features::twoFactorAuthentication(), 'confirm') && $user->two_factor_secret && is_null($user->two_factor_confirmed_at)) {
             // Confirmation was abandoned, disable 2FA
             resolve(DisableTwoFactorAuthentication::class)($user);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] FunctionCallRemoval
Livewire/Settings/TwoFactor.php:46:13
             $user->two_factor_secret &&
             is_null($user->two_factor_confirmed_at)) {
             // Confirmation was abandoned, disable 2FA
-            resolve(DisableTwoFactorAuthentication::class)($user);
+            
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/TwoFactor.php:121:5
     /**
      * Get the two-factor authentication QR code SVG.
      */
-    #[Computed]
+    protected function qrCodeSvg(): ?string
     public function qrCodeSvg(): ?string
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] ReturnRemoval
Livewire/Settings/TwoFactor.php:125:13
     public function qrCodeSvg(): ?string
     {
         try {
-            return auth()->user()->twoFactorQrCodeSvg();
+            
         } catch (DecryptException) {
             return null;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/TwoFactor.php:134:5
     /**
      * Get the two-factor authentication manual setup key.
      */
-    #[Computed]
+    protected function manualSetupKey(): ?string
     public function manualSetupKey(): ?string
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] ReturnRemoval
Livewire/Settings/TwoFactor.php:138:13
     public function manualSetupKey(): ?string
     {
         try {
-            return auth()->user()->twoFactorQrCodeUrl();
+            
         } catch (DecryptException) {
             return null;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/TwoFactor.php:147:5
     /**
      * Determine if two-factor authentication is enabled.
      */
-    #[Computed]
+    protected function twoFactorEnabled(): bool
     public function twoFactorEnabled(): bool
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Livewire/Settings/TwoFactor.php:150:9
     #[Computed]
     public function twoFactorEnabled(): bool
     {
-        return ! empty(auth()->user()->two_factor_secret) &&
-               ! is_null(auth()->user()->two_factor_confirmed_at);
+        return empty(auth()->user()->two_factor_secret) && is_null(auth()->user()->two_factor_confirmed_at);d_at);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] LogicalNot
Livewire/Settings/TwoFactor.php:150:9
     #[Computed]
     public function twoFactorEnabled(): bool
     {
-        return ! empty(auth()->user()->two_factor_secret) &&
+        return empty(auth()->user()->two_factor_secret) && !is_null(auth()->user()->two_factor_confirmed_at);
                ! is_null(auth()->user()->two_factor_confirmed_at);
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] LogicalNot
Livewire/Settings/TwoFactor.php:151:16
     public function twoFactorEnabled(): bool
     {
         return ! empty(auth()->user()->two_factor_secret) &&
-               ! is_null(auth()->user()->two_factor_confirmed_at);
+               return !empty(auth()->user()->two_factor_secret) && is_null(auth()->user()->two_factor_confirmed_at);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/TwoFactor.php:157:5
     /**
      * Determine if two-factor authentication requires confirmation.
      */
-    #[Computed]
+    protected function requiresConfirmation(): bool
     public function requiresConfirmation(): bool
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] PublicVisibility
Livewire/Settings/TwoFactor.php:168:5
      *
      * @return array{title: string, description: string, buttonText: string}
      */
-    #[Computed]
+    protected function modalConfig(): array
     public function modalConfig(): array
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.

[Killed] ArrayItemRemoval
Livewire/Settings/TwoFactor.php:191:9
      */
     public function render(): View
     {
-        return view('livewire.settings.two-factor', [
-            'twoFactorEnabled' => $this->twoFactorEnabled,
-            'requiresConfirmation' => $this->requiresConfirmation,
-            'qrCodeSvg' => $this->qrCodeSvg,
-            'manualSetupKey' => $this->manualSetupKey,
-        ]);
+        return view('livewire.settings.two-factor', ['requiresConfirmation' => $this->requiresConfirmation, 'qrCodeSvg' => $this->qrCodeSvg, 'manualSetupKey' => $this->manualSetupKey]);
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Settings/TwoFactorAuthenticationTest.php" not found.
