[Killed] PublicVisibility
Models/Builders/TeamBuilder.php:26:5
      *
      * @psalm-return static<TModelClass>
      */
-    public function inContext(?User $user = null): static
+    protected function inContext(?User $user = null): static
     {
         $user ??= auth()->user();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.

[Killed] AssignCoalesce
Models/Builders/TeamBuilder.php:28:9
      */
     public function inContext(?User $user = null): static
     {
-        $user ??= auth()->user();
+        $user = auth()->user();
 
         if (! $user instanceof User || ! $user->current_context_id) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.

[Killed] LogicalNot
Models/Builders/TeamBuilder.php:30:9
     {
         $user ??= auth()->user();
 
-        if (! $user instanceof User || ! $user->current_context_id) {
+        if (!$user instanceof User || $user->current_context_id) {
             return $this;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.

[Killed] LogicalOr
Models/Builders/TeamBuilder.php:30:9
     {
         $user ??= auth()->user();
 
-        if (! $user instanceof User || ! $user->current_context_id) {
+        if (!$user instanceof User && !$user->current_context_id) {
             return $this;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.

[Killed] ReturnRemoval
Models/Builders/TeamBuilder.php:31:13
         $user ??= auth()->user();
 
         if (! $user instanceof User || ! $user->current_context_id) {
-            return $this;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextScopingTest.php" not found.

[Killed] CastInt
Models/Builders/TeamBuilder.php:34:9
             return $this;
         }
 
-        $contextId = (int) $user->current_context_id;
+        $contextId = $user->current_context_id;
 
         return $this->whereIn('id', static function (\Illuminate\Database\Query\Builder $query) use ($contextId): void {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.

[Killed] MethodCallRemoval
Models/Builders/TeamBuilder.php:38:13
 
         return $this->whereIn('id', static function (\Illuminate\Database\Query\Builder $query) use ($contextId): void {
             // Recursive Common Table Expression (CTE)
-            $query->select('id')->from(DB::raw("(
-                    WITH RECURSIVE descendants AS (
-                        SELECT id, parent_id FROM teams WHERE id = {$contextId}
-                        UNION ALL
-                        SELECT t.id, t.parent_id FROM teams t
-                        JOIN descendants d ON t.parent_id = d.id
-                    )
-                    SELECT id FROM descendants
-                ) as contextual_teams"));
+            
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.

[Killed] PublicVisibility
Models/Builders/TeamBuilder.php:55:5
      *
      * @psalm-return static<TModelClass>
      */
-    public function withoutContextScope(): static
+    protected function withoutContextScope(): static
     {
         // Explicitly communicates intent, even if it does nothing functionally
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/ContextBypassTest.php" not found.
