[Killed] IfNegation
Models/Concerns/HasTeamHierarchy.php:29:13
 
         static::updating(static function (Team $team): void {
             // Only validate if parent_id or type is being changed
-            if ($team->isDirty(['parent_id', 'type'])) {
-                $team->validateHierarchy();
-            }
+            if (!$team->isDirty(['parent_id', 'type'])) {
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] MethodCallRemoval
Models/Concerns/HasTeamHierarchy.php:30:17
         static::updating(static function (Team $team): void {
             // Only validate if parent_id or type is being changed
             if ($team->isDirty(['parent_id', 'type'])) {
-                $team->validateHierarchy();
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] PublicVisibility
Models/Concerns/HasTeamHierarchy.php:38:5
     /**
      * Update tenant IDs for all descendants recursively using collections.
      */
-    public function updateDescendantTenants(string $newTenantId): void
+    protected function updateDescendantTenants(string $newTenantId): void
     {
         $this->children()
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/HasTeamHierarchy.php:40:9
      */
     public function updateDescendantTenants(string $newTenantId): void
     {
-        $this->children()
-            ->withoutGlobalScopes()
-            ->get()
-            ->each(static function (Team $child) use ($newTenantId): void {
-                $child->tenant_id = $newTenantId;
-                $child->save(); // Triggers updated recursively
-            });
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] NotIdentical
Models/Concerns/HasTeamHierarchy.php:64:9
         }
 
         // Ensure type is set as enum on the model for validators
-        if ($this->getAttribute('type') !== $type) {
+        if ($this->getAttribute('type') === $type) {
             $this->setAttribute('type', $type);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] MethodCallRemoval
Models/Concerns/HasTeamHierarchy.php:69:9
         }
 
         // Use collection pipeline with Higher Order Messaging
-        $this->getValidators()
-            ->each->validate($this); // Higher Order Messaging eliminates loop complexity
+         // Higher Order Messaging eliminates loop complexity
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] PublicVisibility
Models/Concerns/HasTeamHierarchy.php:78:5
      *
      * Delegates to traversal service for collection-based implementation.
      */
-    public function isDescendantOf(Team $team): bool
+    protected function isDescendantOf(Team $team): bool
     {
         return resolve(TeamHierarchyTraversalService::class)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/HasTeamHierarchy.php:91:5
      *
      * @psalm-return int<1, max>
      */
-    public function getDepth(): int
+    protected function getDepth(): int
     {
         return resolve(TeamHierarchyTraversalService::class)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/HasTeamHierarchy.php:127:13
         $typeValue = $this->getAttribute('type');
 
         if ($typeValue instanceof TeamType) {
-            return $typeValue;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.
