[Killed] ProtectedVisibility
Models/Concerns/HasTeamSearch.php:20:5
      *
      * @psalm-return TeamBuilder<Team>
      */
-    #[Scope]
+    private function fuzzySearch(TeamBuilder $query, string $term): TeamBuilder
     protected function fuzzySearch(TeamBuilder $query, string $term): TeamBuilder
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.

[Killed] ProtectedVisibility
Models/Concerns/HasTeamSearch.php:37:5
      *
      * @psalm-return TeamBuilder<Team>
      */
-    #[Scope]
+    private function fullTextSearch(TeamBuilder $query, string $term): TeamBuilder
     protected function fullTextSearch(TeamBuilder $query, string $term): TeamBuilder
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.

[Killed] ArrayItemRemoval
Models/Concerns/HasTeamSearch.php:42:13
     {
         // Use plainto_tsquery for better handling of plain text search terms
         return $query->whereRaw('search_vector @@ plainto_tsquery(?, ?)', ['english', $term])
-            ->orderByRaw('ts_rank(search_vector, plainto_tsquery(?, ?)) DESC', ['english', $term]);
+            return $query->whereRaw('search_vector @@ plainto_tsquery(?, ?)', ['english', $term])->orderByRaw('ts_rank(search_vector, plainto_tsquery(?, ?)) DESC', [$term]);
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.
