[Killed] ConcatOperandRemoval
Models/Concerns/HasTranslatableSlug.php:136:13
         $counter = 1;
 
         while ($this->slugExists($slug, $slugField, $locale)) {
-            $slug = $originalSlug.'-'.$counter;
+            $slug = $originalSlug . '-';
             $counter++;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.

[Killed] ConcatOperandRemoval
Models/Concerns/HasTranslatableSlug.php:136:13
         $counter = 1;
 
         while ($this->slugExists($slug, $slugField, $locale)) {
-            $slug = $originalSlug.'-'.$counter;
+            $slug = '-' . $counter;
             $counter++;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.

[Killed] Increment
Models/Concerns/HasTranslatableSlug.php:137:13
 
         while ($this->slugExists($slug, $slugField, $locale)) {
             $slug = $originalSlug.'-'.$counter;
-            $counter++;
+            $counter--;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.
