[Killed] PublicVisibility
Models/Concerns/HasUlid.php:27:5
      *
      * @psalm-return 'ulid'
      */
-    public function getRouteKeyName(): string
+    protected function getRouteKeyName(): string
     {
         return 'ulid';
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/HasUlid.php:36:5
      * Retrieve the model for a bound value.
      * Supports both ULID and integer ID for backward compatibility.
      */
-    public function resolveRouteBinding($value, $field = null): ?Model
+    protected function resolveRouteBinding($value, $field = null): ?Model
     {
         $field ??= $this->getRouteKeyName();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] AssignCoalesce
Models/Concerns/HasUlid.php:38:9
      */
     public function resolveRouteBinding($value, $field = null): ?Model
     {
-        $field ??= $this->getRouteKeyName();
+        $field = $this->getRouteKeyName();
 
         // If field is 'ulid', try ULID first, then fall back to integer ID for backward compatibility
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] Identical
Models/Concerns/HasUlid.php:41:9
         $field ??= $this->getRouteKeyName();
 
         // If field is 'ulid', try ULID first, then fall back to integer ID for backward compatibility
-        if ($field === 'ulid') {
+        if ($field !== 'ulid') {
             // Try ULID first
             $model = static::where('ulid', $value)->first();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] IfNegation
Models/Concerns/HasUlid.php:44:13
         if ($field === 'ulid') {
             // Try ULID first
             $model = static::where('ulid', $value)->first();
-            if ($model) {
-                return $model;
-            }
+            if (!$model) {
 
             // Fall back to integer ID if value is numeric (backward compatibility)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/HasUlid.php:45:17
             // Try ULID first
             $model = static::where('ulid', $value)->first();
             if ($model) {
-                return $model;
+                
             }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] IfNegation
Models/Concerns/HasUlid.php:49:13
             }
 
             // Fall back to integer ID if value is numeric (backward compatibility)
-            if (is_numeric($value)) {
-                return static::where('id', (int) $value)->first();
-            }
+            if (!is_numeric($value)) {
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/HasUlid.php:50:17
 
             // Fall back to integer ID if value is numeric (backward compatibility)
             if (is_numeric($value)) {
-                return static::where('id', (int) $value)->first();
+                
             }
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/BackwardCompatibilityTest.php" not found.

[Killed] ProtectedVisibility
Models/Concerns/HasUlid.php:63:5
      * @param  Builder<Model>  $query
      * @return Builder<Model>
      */
-    protected function scopeByUlid(Builder $query, string $ulid): Builder
+    private function scopeByUlid(Builder $query, string $ulid): Builder
     {
         return $query->where('ulid', $ulid);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/UlidRouteBindingTest.php" not found.
