[Killed] ProtectedVisibility
Models/Concerns/HasUserSearch.php:20:5
      *
      * @psalm-return UserBuilder<User>
      */
-    #[Scope]
+    private function fuzzySearch(UserBuilder $query, string $term): UserBuilder
     protected function fuzzySearch(UserBuilder $query, string $term): UserBuilder
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.

[Killed] ArrayItemRemoval
Models/Concerns/HasUserSearch.php:25:9
     {
         // Use similarity with a lower threshold (0.1) to catch more matches
         // The % operator uses default threshold of 0.3 which is too strict
-        return $query->whereRaw('similarity(name, ?) > 0.1', [$term])
+        return $query->whereRaw('similarity(name, ?) > 0.1', [])->orderByRaw('similarity(name, ?) DESC', [$term]);
             ->orderByRaw('similarity(name, ?) DESC', [$term]);
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.
