[Killed] PublicVisibility
Models/Concerns/ManagesTeamRoles.php:22:5
      * - Executive and Deputy cannot be the same person
      * - Executive/Deputy must be from the same Enterprise as the team
      */
-    public function validateExecutiveDeputyConstraints(User $user, string $role): void
+    protected function validateExecutiveDeputyConstraints(User $user, string $role): void
     {
         // Validate same enterprise constraint
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Models/Concerns/ManagesTeamRoles.php:25:9
     public function validateExecutiveDeputyConstraints(User $user, string $role): void
     {
         // Validate same enterprise constraint
-        if ($this->tenant_id && $user->tenant_id && $this->tenant_id !== $user->tenant_id) {
+        if (!$this->tenant_id && !$user->tenant_id && !($this->tenant_id !== $user->tenant_id)) {
             throw ValidationException::withMessages([
                 $role => ['The user must belong to the same enterprise as the team.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] LogicalAndNegation
Models/Concerns/ManagesTeamRoles.php:25:9
     public function validateExecutiveDeputyConstraints(User $user, string $role): void
     {
         // Validate same enterprise constraint
-        if ($this->tenant_id && $user->tenant_id && $this->tenant_id !== $user->tenant_id) {
+        if (!($this->tenant_id && $user->tenant_id && $this->tenant_id !== $user->tenant_id)) {
             throw ValidationException::withMessages([
                 $role => ['The user must belong to the same enterprise as the team.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:31:9
             ]);
         }
 
-        $this->withTeamContext(function () use ($user, $role): void {
-            $this->checkRoleConflict($user, $role);
-        });
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:32:13
         }
 
         $this->withTeamContext(function () use ($user, $role): void {
-            $this->checkRoleConflict($user, $role);
+            
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/ManagesTeamRoles.php:39:5
     /**
      * Get the executive user for this team.
      */
-    public function executive(): ?User
+    protected function executive(): ?User
     {
         // Closure executes query logic, cannot use first-class callable syntax
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/ManagesTeamRoles.php:48:5
     /**
      * Assign an executive to this team.
      */
-    public function assignExecutive(User $user): void
+    protected function assignExecutive(User $user): void
     {
         $this->validateExecutiveDeputyConstraints($user, 'executive');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:50:9
      */
     public function assignExecutive(User $user): void
     {
-        $this->validateExecutiveDeputyConstraints($user, 'executive');
+        
 
         $this->withTeamContext(static function () use ($user): void {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/ManagesTeamRoles.php:60:21
                     $userId = $user->getKey();
 
                     /** @var User|null */
-                    return User::query()
-                        ->role('executive')
-                        ->where('id', '!=', $userId)
-                        ->first();
+                    
                 },
                 ['Checking for existing executive']
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ArrayItemRemoval
Models/Concerns/ManagesTeamRoles.php:65:17
                         ->where('id', '!=', $userId)
                         ->first();
                 },
-                ['Checking for existing executive']
+                }, []);
             );
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] NotIdentical
Models/Concerns/ManagesTeamRoles.php:72:21
             // Otherwise, check if we got a result (existing executive)
             $result->match(
                 onSuccess: static function ($existing): void {
-                    if ($existing !== null) {
+                    if ($existing === null) {
                         throw ValidationException::withMessages([
                             'executive' => ['This team already has an executive assigned.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] Throw_
Models/Concerns/ManagesTeamRoles.php:73:25
             $result->match(
                 onSuccess: static function ($existing): void {
                     if ($existing !== null) {
-                        throw ValidationException::withMessages([
-                            'executive' => ['This team already has an executive assigned.'],
-                        ]);
+                        ValidationException::withMessages(['executive' => ['This team already has an executive assigned.']]);
                     }
                 },
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ArrayItemRemoval
Models/Concerns/ManagesTeamRoles.php:73:25
             $result->match(
                 onSuccess: static function ($existing): void {
                     if ($existing !== null) {
-                        throw ValidationException::withMessages([
-                            'executive' => ['This team already has an executive assigned.'],
-                        ]);
+                        throw ValidationException::withMessages([]);
                     }
                 },
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:99:13
                 }
             );
 
-            $user->assignRole('executive');
+            
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/ManagesTeamRoles.php:108:5
      *
      * Uses collection each for functional approach.
      */
-    public function removeExecutive(): void
+    protected function removeExecutive(): void
     {
         $this->withTeamContext(static function (): void {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:110:9
      */
     public function removeExecutive(): void
     {
-        $this->withTeamContext(static function (): void {
-            User::query()
-                ->role('executive')
-                ->get()
-                ->each(static fn (User $exec) => $exec->removeRole('executive'));
-        });
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:111:13
     public function removeExecutive(): void
     {
         $this->withTeamContext(static function (): void {
-            User::query()
-                ->role('executive')
-                ->get()
-                ->each(static fn (User $exec) => $exec->removeRole('executive'));
+            
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/ManagesTeamRoles.php:163:5
     /**
      * Assign a deputy to this team.
      */
-    public function assignDeputy(User $user): void
+    protected function assignDeputy(User $user): void
     {
         $this->validateExecutiveDeputyConstraints($user, 'deputy');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:165:9
      */
     public function assignDeputy(User $user): void
     {
-        $this->validateExecutiveDeputyConstraints($user, 'deputy');
+        
 
         $this->withTeamContext(static function () use ($user): void {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:167:9
     {
         $this->validateExecutiveDeputyConstraints($user, 'deputy');
 
-        $this->withTeamContext(static function () use ($user): void {
-            $user->assignRole('deputy');
-        });
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] MethodCallRemoval
Models/Concerns/ManagesTeamRoles.php:168:13
         $this->validateExecutiveDeputyConstraints($user, 'deputy');
 
         $this->withTeamContext(static function () use ($user): void {
-            $user->assignRole('deputy');
+            
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] PublicVisibility
Models/Concerns/ManagesTeamRoles.php:185:5
     /**
      * Get all deputies for this team.
      */
-    public function deputies(): Collection
+    protected function deputies(): Collection
     {
         // @mago-expect Closure executes query logic, not forwarding arguments - first-class callable syntax not applicable
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ProtectedVisibility
Models/Concerns/ManagesTeamRoles.php:194:5
     /**
      * Execute a callback within the team's permission context.
      */
-    protected function withTeamContext(callable $callback): mixed
+    private function withTeamContext(callable $callback): mixed
     {
         $previousTeamId = getPermissionsTeamId();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] FunctionCallRemoval
Models/Concerns/ManagesTeamRoles.php:197:9
     protected function withTeamContext(callable $callback): mixed
     {
         $previousTeamId = getPermissionsTeamId();
-        setPermissionsTeamId($this->id);
+        
 
         try {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] UnwrapFinally
Models/Concerns/ManagesTeamRoles.php:199:9
         $previousTeamId = getPermissionsTeamId();
         setPermissionsTeamId($this->id);
 
-        try {
-            return $callback();
-        } finally {
-            setPermissionsTeamId($previousTeamId);
-        }
+        return $callback();
+        setPermissionsTeamId($previousTeamId);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/ManagesTeamRoles.php:200:13
         setPermissionsTeamId($this->id);
 
         try {
-            return $callback();
+            
         } finally {
             setPermissionsTeamId($previousTeamId);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] FunctionCallRemoval
Models/Concerns/ManagesTeamRoles.php:202:13
         try {
             return $callback();
         } finally {
-            setPermissionsTeamId($previousTeamId);
+            
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] Ternary
Models/Concerns/ManagesTeamRoles.php:213:9
      */
     private function checkRoleConflict(User $user, string $role): void
     {
-        $conflictingRole = $role === 'executive' ? 'deputy' : 'executive';
+        $conflictingRole = $role === 'executive' ? 'executive' : 'deputy';
 
         // Use Result monad to handle RoleDoesNotExist as "error as value"
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/ManagesTeamRoles.php:224:17
                 $userId = $user->getKey();
 
                 /** @var bool */
-                return User::query()->role($conflictingRole)->where('id', $userId)->exists();
+                
             },
             ['Checking for role conflict']
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ArrayItemRemoval
Models/Concerns/ManagesTeamRoles.php:226:13
                 /** @var bool */
                 return User::query()->role($conflictingRole)->where('id', $userId)->exists();
             },
-            ['Checking for role conflict']
+            }, []);
         );
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] CastBool
Models/Concerns/ManagesTeamRoles.php:232:13
         /** @var bool $hasConflictingRole */
         $hasConflictingRole = $result->match(
             // @mago-expect Identity function in monadic context, not a boolean flag parameter
-            onSuccess: static fn (mixed $exists, array $logs): bool => (bool) $exists,
+            onSuccess: static fn(mixed $exists, array $logs): bool => $exists,
             onFailure: /**
              * @return false
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] FalseValue
Models/Concerns/ManagesTeamRoles.php:238:17
              */
             static function (string $error, array $logs): bool {
                 // Check if the exception was RoleDoesNotExist by examining logs
-                $isRoleDoesNotExist = false;
+                $isRoleDoesNotExist = true;
                 foreach ($logs as $log) {
                     if (! str_contains($log, 'RoleDoesNotExist')) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] Foreach_
Models/Concerns/ManagesTeamRoles.php:239:17
             static function (string $error, array $logs): bool {
                 // Check if the exception was RoleDoesNotExist by examining logs
                 $isRoleDoesNotExist = false;
-                foreach ($logs as $log) {
-                    if (! str_contains($log, 'RoleDoesNotExist')) {
-                        continue;
-                    }
-
-                    $isRoleDoesNotExist = true;
-
-                    break;
-                }
+                foreach ([] as $log) {
 
                 // Role doesn't exist yet, so no conflict to check
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] LogicalNot
Models/Concerns/ManagesTeamRoles.php:240:21
                 // Check if the exception was RoleDoesNotExist by examining logs
                 $isRoleDoesNotExist = false;
                 foreach ($logs as $log) {
-                    if (! str_contains($log, 'RoleDoesNotExist')) {
+                    if (str_contains($log, 'RoleDoesNotExist')) {
                         continue;
                     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] Continue_
Models/Concerns/ManagesTeamRoles.php:241:25
                 $isRoleDoesNotExist = false;
                 foreach ($logs as $log) {
                     if (! str_contains($log, 'RoleDoesNotExist')) {
-                        continue;
+                        break;
                     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] TrueValue
Models/Concerns/ManagesTeamRoles.php:244:21
                         continue;
                     }
 
-                    $isRoleDoesNotExist = true;
+                    $isRoleDoesNotExist = false;
 
                     break;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] Break_
Models/Concerns/ManagesTeamRoles.php:246:21
 
                     $isRoleDoesNotExist = true;
 
-                    break;
+                    continue;
                 }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] FunctionCallRemoval
Models/Concerns/ManagesTeamRoles.php:252:17
                 // Role doesn't exist yet, so no conflict to check
                 // This is expected behavior when roles haven't been created yet
                 // Only return false for RoleDoesNotExist, re-throw other exceptions
-                throw_unless($isRoleDoesNotExist, RuntimeException::class, $error);
+                
 
                 return false;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/ManagesTeamRoles.php:254:17
                 // Only return false for RoleDoesNotExist, re-throw other exceptions
                 throw_unless($isRoleDoesNotExist, RuntimeException::class, $error);
 
-                return false;
+                
             }
         );
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] LogicalNot
Models/Concerns/ManagesTeamRoles.php:258:9
             }
         );
 
-        if (! $hasConflictingRole) {
+        if ($hasConflictingRole) {
             return;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/ManagesTeamRoles.php:259:13
         );
 
         if (! $hasConflictingRole) {
-            return;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/ExecutiveDeputyConstraintsTest.php" not found.
