[Killed] FalseValue
Models/Concerns/ManagesUserContext.php:24:13
             ->exists();
 
         if (! $hasAccess) {
-            return false;
+            return true;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/InvalidContextTest.php" not found.

[Killed] ReturnRemoval
Models/Concerns/ManagesUserContext.php:24:13
             ->exists();
 
         if (! $hasAccess) {
-            return false;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Context/InvalidContextTest.php" not found.
