[Killed] LogicalAndSingleSubExprNegation
Models/Concerns/ProtectsKeyRoles.php:15:13
     {
         static::deleting(static function ($user): void {
             // Check protection using the model method
-            if (method_exists($user, 'isProtectable') && $user->isProtectable()) {
+            if (method_exists($user, 'isProtectable') && !$user->isProtectable()) {
                 throw new CannotDeleteKeyUserException();
             }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] LogicalAnd
Models/Concerns/ProtectsKeyRoles.php:15:13
     {
         static::deleting(static function ($user): void {
             // Check protection using the model method
-            if (method_exists($user, 'isProtectable') && $user->isProtectable()) {
+            if (method_exists($user, 'isProtectable') || $user->isProtectable()) {
                 throw new CannotDeleteKeyUserException();
             }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] Throw_
Models/Concerns/ProtectsKeyRoles.php:16:17
         static::deleting(static function ($user): void {
             // Check protection using the model method
             if (method_exists($user, 'isProtectable') && $user->isProtectable()) {
-                throw new CannotDeleteKeyUserException();
+                new CannotDeleteKeyUserException();
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.
