[Killed] PublicVisibility
Models/Team.php:123:5
         return $this->belongsTo(self::class, 'parent_id')->withoutGlobalScopes();
     }
 
-    public function children(): HasMany
+    protected function children(): HasMany
     {
         return $this->hasMany(self::class, 'parent_id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamHierarchyTraversalServiceTest.php" not found.

[Killed] PublicVisibility
Models/Team.php:128:5
         return $this->hasMany(self::class, 'parent_id');
     }
 
-    public function tenant(): BelongsTo
+    protected function tenant(): BelongsTo
     {
         return $this->belongsTo(Enterprise::class, 'tenant_id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] PublicVisibility
Models/Team.php:170:5
      *
      * @psalm-return array{id: mixed, ulid: string, name: mixed, slug: mixed, bio: mixed, type: string, status: string}
      */
-    public function toSearchableArray(): array
+    protected function toSearchableArray(): array
     {
         return [
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.

[Killed] ProtectedVisibility
Models/Team.php:209:5
      *
      * Delegates to TeamBioRenderer for improved testability and separation of concerns.
      */
-    protected function getBioHtmlAttribute(): ?string
+    private function getBioHtmlAttribute(): ?string
     {
         // Get bio in current locale, with fallback to default locale
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] TrueValue
Models/Team.php:213:9
     {
         // Get bio in current locale, with fallback to default locale
         // The third parameter (true) enables fallback to default locale
-        $bio = $this->getTranslation('bio', app()->getLocale(), true);
+        $bio = $this->getTranslation('bio', app()->getLocale(), false);
 
         // If bio is still null/empty, try accessing it directly as an attribute
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] NotIdentical
Models/Team.php:217:9
 
         // If bio is still null/empty, try accessing it directly as an attribute
         // This handles cases where bio might be set as a string directly (Spatie should handle this, but this is a safety net)
-        if (($bio === null || $bio === '') && $this->bio !== null && $this->bio !== '') {
+        if (($bio === null || $bio === '') && $this->bio !== null && $this->bio === '') {
             if (is_string($this->bio)) {
                 $bio = $this->bio;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] NotIdentical
Models/Team.php:217:9
 
         // If bio is still null/empty, try accessing it directly as an attribute
         // This handles cases where bio might be set as a string directly (Spatie should handle this, but this is a safety net)
-        if (($bio === null || $bio === '') && $this->bio !== null && $this->bio !== '') {
+        if (($bio === null || $bio === '') && $this->bio === null && $this->bio !== '') {
             if (is_string($this->bio)) {
                 $bio = $this->bio;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.
