[Killed] PublicVisibility
Models/TeamMoveApproval.php:62:5
         'rejection_reason',
     ];
 
-    public function isPending(): bool
+    protected function isPending(): bool
     {
         return $this->status === 'pending';
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Models/TeamMoveApproval.php:64:9
 
     public function isPending(): bool
     {
-        return $this->status === 'pending';
+        return $this->status !== 'pending';
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Models/TeamMoveApproval.php:75:9
     #[Override]
     protected function casts(): array
     {
-        return [
-            'required_approvers' => 'array',
-            'approvals' => 'array',
-            'approved_at' => 'datetime',
-            'rejected_at' => 'datetime',
-        ];
+        return ['approvals' => 'array', 'approved_at' => 'datetime', 'rejected_at' => 'datetime'];
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
