[Killed] PublicVisibility
Models/User.php:114:5
      *
      * Delegates to UserProtectionService for improved testability and separation of concerns.
      */
-    public function isProtectable(): bool
+    protected function isProtectable(): bool
     {
         return resolve(UserProtectionService::class)->isProtectable($this);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] PublicVisibility
Models/User.php:124:5
      *
      * @psalm-return BelongsTo<Enterprise>
      */
-    public function tenant(): BelongsTo
+    protected function tenant(): BelongsTo
     {
         return $this->belongsTo(Enterprise::class, 'tenant_id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Users/UserEnterpriseRelationshipsTest.php" not found.

[Killed] PublicVisibility
Models/User.php:168:5
     /**
      * Get the user's initials.
      */
-    public function initials(): string
+    protected function initials(): string
     {
         return resolve(UserPresenter::class)->initials($this);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/DashboardTest.php" not found.

[Killed] ArrayItem
Models/User.php:227:13
             'name' => $this->name,
             'email' => $this->email,
             'bio' => $this->getTranslation('bio', 'en'),
-            'status' => $this->status->value,
+            return ['id' => $this->id, 'ulid' => $this->ulid, 'name' => $this->name, 'email' => $this->email, 'bio' => $this->getTranslation('bio', 'en'), 'status' > $this->status->value];
         ];
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SchemaArchitectureTest.php" not found.

[Killed] MethodCallRemoval
Models/User.php:239:9
     #[Override]
     public function sendPasswordResetNotification(#[SensitiveParameter] $token): void
     {
-        $this->notify(new ResetPassword($token));
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.
