[Killed] PublicVisibility
Observers/TeamObserver.php:33:5
     /**
      * Handle the Team "updating" event.
      */
-    public function updating(Team $team): void
+    protected function updating(Team $team): void
     {
         // Enforce immutability of certain fields if needed
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] LogicalAndAllSubExprNegation
Observers/TeamObserver.php:37:9
     {
         // Enforce immutability of certain fields if needed
         // For example, tenant_id usually shouldn't change after creation
-        if ($team->isDirty('tenant_id') && $team->getOriginal('tenant_id') !== null) {
+        if (!$team->isDirty('tenant_id') && !($team->getOriginal('tenant_id') !== null)) {
             /** @var mixed $originalTenantId */
             $originalTenantId = $team->getOriginal('tenant_id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] LogicalAnd
Observers/TeamObserver.php:37:9
     {
         // Enforce immutability of certain fields if needed
         // For example, tenant_id usually shouldn't change after creation
-        if ($team->isDirty('tenant_id') && $team->getOriginal('tenant_id') !== null) {
+        if ($team->isDirty('tenant_id') || $team->getOriginal('tenant_id') !== null) {
             /** @var mixed $originalTenantId */
             $originalTenantId = $team->getOriginal('tenant_id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] IfNegation
Observers/TeamObserver.php:44:9
         }
 
         // Validate unique name if name is being changed
-        if ($team->isDirty('name')) {
-            $this->validateUniqueName($team);
-        }
+        if (!$team->isDirty('name')) {
 
         // Update tenant_id if parent_id is being changed
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] MethodCallRemoval
Observers/TeamObserver.php:45:13
 
         // Validate unique name if name is being changed
         if ($team->isDirty('name')) {
-            $this->validateUniqueName($team);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Optimistic Locking (Tests\Feature\Teams\OptimisticLocking)" not found.

[Killed] IfNegation
Observers/TeamObserver.php:49:9
         }
 
         // Update tenant_id if parent_id is being changed
-        if ($team->isDirty('parent_id')) {
-            $this->updateTenantId($team);
-        }
+        if (!$team->isDirty('parent_id')) {
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] MethodCallRemoval
Observers/TeamObserver.php:50:13
 
         // Update tenant_id if parent_id is being changed
         if ($team->isDirty('parent_id')) {
-            $this->updateTenantId($team);
+            
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] CastInt
Observers/TeamObserver.php:62:13
     {
         // Only valid for existing models (updates)
         if ($team->exists && ! $team->isDirty('lock_version')) {
-            $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
+            $currentDbVersion = DB::table('teams')->where('id', $team->id)->value('lock_version');
             $originalVersion = (int) ($team->getOriginal('lock_version') ?? 0);
             throw_if($currentDbVersion !== $originalVersion, OptimisticLockingException::class);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] IncrementInteger
Observers/TeamObserver.php:63:13
         // Only valid for existing models (updates)
         if ($team->exists && ! $team->isDirty('lock_version')) {
             $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
-            $originalVersion = (int) ($team->getOriginal('lock_version') ?? 0);
+            $originalVersion = (int) ($team->getOriginal('lock_version') ?? 1);
             throw_if($currentDbVersion !== $originalVersion, OptimisticLockingException::class);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] DecrementInteger
Observers/TeamObserver.php:63:13
         // Only valid for existing models (updates)
         if ($team->exists && ! $team->isDirty('lock_version')) {
             $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
-            $originalVersion = (int) ($team->getOriginal('lock_version') ?? 0);
+            $originalVersion = (int) ($team->getOriginal('lock_version') ?? -1);
             throw_if($currentDbVersion !== $originalVersion, OptimisticLockingException::class);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] FunctionCallRemoval
Observers/TeamObserver.php:64:13
         if ($team->exists && ! $team->isDirty('lock_version')) {
             $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
             $originalVersion = (int) ($team->getOriginal('lock_version') ?? 0);
-            throw_if($currentDbVersion !== $originalVersion, OptimisticLockingException::class);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] NotIdentical
Observers/TeamObserver.php:64:13
         if ($team->exists && ! $team->isDirty('lock_version')) {
             $currentDbVersion = (int) DB::table('teams')->where('id', $team->id)->value('lock_version');
             $originalVersion = (int) ($team->getOriginal('lock_version') ?? 0);
-            throw_if($currentDbVersion !== $originalVersion, OptimisticLockingException::class);
+            throw_if($currentDbVersion === $originalVersion, OptimisticLockingException::class);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] Throw_
Observers/TeamObserver.php:84:13
         $result = $validator->validateUnique($team);
 
         if ($result->isFailure) {
-            throw ValidationException::withMessages([
-                'name' => [$result->error],
-            ]);
+            ValidationException::withMessages(['name' => [$result->error]]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.

[Killed] ArrayItemRemoval
Observers/TeamObserver.php:85:17
 
         if ($result->isFailure) {
             throw ValidationException::withMessages([
-                'name' => [$result->error],
+                throw ValidationException::withMessages(['name' => []]);
             ]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.
