[Killed] PublicVisibility
Observers/UserObserver.php:17:5
      *
      * Prevents deletion of users who are executives or deputies of teams.
      */
-    public function deleting(User $user): void
+    protected function deleting(User $user): void
     {
         throw_if($user->isProtectable(), CannotDeleteKeyUserException::class);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] FunctionCallRemoval
Observers/UserObserver.php:19:9
      */
     public function deleting(User $user): void
     {
-        throw_if($user->isProtectable(), CannotDeleteKeyUserException::class);
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.
