[Killed] PublicVisibility
Policies/TeamPolicy.php:15:5
     /**
      * Determine whether the user can update the team.
      */
-    public function update(User $user, Team $team): bool
+    protected function update(User $user, Team $team): bool
     {
         $executive = $team->executive();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] LogicalAnd
Policies/TeamPolicy.php:18:9
     public function update(User $user, Team $team): bool
     {
         $executive = $team->executive();
-        if ($executive && $executive->id === $user->id) {
+        if ($executive || $executive->id === $user->id) {
             return true;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] LogicalAndNegation
Policies/TeamPolicy.php:18:9
     public function update(User $user, Team $team): bool
     {
         $executive = $team->executive();
-        if ($executive && $executive->id === $user->id) {
+        if (!($executive && $executive->id === $user->id)) {
             return true;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] ReturnRemoval
Policies/TeamPolicy.php:19:13
     {
         $executive = $team->executive();
         if ($executive && $executive->id === $user->id) {
-            return true;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.

[Killed] TrueValue
Policies/TeamPolicy.php:19:13
     {
         $executive = $team->executive();
         if ($executive && $executive->id === $user->id) {
-            return true;
+            return false;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioPermissionsTest.php" not found.
