[Killed] PublicVisibility
Policies/UserPolicy.php:14:5
      *
      * @return false
      */
-    public function create(): bool
+    protected function create(): bool
     {
         return false;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SuperAdminRoleTest.php" not found.

[Killed] PublicVisibility
Policies/UserPolicy.php:24:5
      *
      * @return false
      */
-    public function update(): bool
+    protected function update(): bool
     {
         return false;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SuperAdminRoleTest.php" not found.

[Killed] PublicVisibility
Policies/UserPolicy.php:34:5
      *
      * @return false
      */
-    public function delete(): bool
+    protected function delete(): bool
     {
         return false;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/SuperAdminRoleTest.php" not found.
