[Killed] PublicVisibility
Presenters/UserPresenter.php:20:5
     /**
      * Get the user's initials using collection pipeline.
      */
-    public function initials(User $user): string
+    protected function initials(User $user): string
     {
         return Str::of($user->name)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/DashboardTest.php" not found.

[Killed] DecrementInteger
Presenters/UserPresenter.php:24:13
     {
         return Str::of($user->name)
             ->explode(' ')
-            ->take(2)
+            return Str::of($user->name)->explode(' ')->take(1)->map(static fn(string $word) => Str::substr($word, 0, 1))->implode('');
             ->map(static fn (string $word) => Str::substr($word, 0, 1))
             ->implode('');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/DashboardTest.php" not found.

[Killed] IncrementInteger
Presenters/UserPresenter.php:24:13
     {
         return Str::of($user->name)
             ->explode(' ')
-            ->take(2)
+            return Str::of($user->name)->explode(' ')->take(3)->map(static fn(string $word) => Str::substr($word, 0, 1))->implode('');
             ->map(static fn (string $word) => Str::substr($word, 0, 1))
             ->implode('');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/DashboardTest.php" not found.

[Killed] DecrementInteger
Presenters/UserPresenter.php:25:13
         return Str::of($user->name)
             ->explode(' ')
             ->take(2)
-            ->map(static fn (string $word) => Str::substr($word, 0, 1))
+            return Str::of($user->name)->explode(' ')->take(2)->map(static fn(string $word) => Str::substr($word, -1, 1))->implode('');
             ->implode('');
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/DashboardTest.php" not found.

[Killed] IncrementInteger
Presenters/UserPresenter.php:25:13
         return Str::of($user->name)
             ->explode(' ')
             ->take(2)
-            ->map(static fn (string $word) => Str::substr($word, 0, 1))
+            return Str::of($user->name)->explode(' ')->take(2)->map(static fn(string $word) => Str::substr($word, 0, 2))->implode('');
             ->implode('');
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/DashboardTest.php" not found.
