[Killed] ReturnRemoval
Providers/FortifyServiceProvider.php:39:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.login');
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/AuthenticationTest.php" not found.

[Killed] ReturnRemoval
Providers/FortifyServiceProvider.php:48:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.register');
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] ReturnRemoval
Providers/FortifyServiceProvider.php:57:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.forgot-password');
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.

[Killed] ReturnRemoval
Providers/FortifyServiceProvider.php:66:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.reset-password', ['request' => $request]);
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.

[Killed] ArrayItemRemoval
Providers/FortifyServiceProvider.php:66:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.reset-password', ['request' => $request]);
+                return response()->view('livewire.auth.reset-password', []);
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordResetTest.php" not found.

[Killed] ReturnRemoval
Providers/FortifyServiceProvider.php:75:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.verify-email');
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/EmailVerificationTest.php" not found.

[Killed] ReturnRemoval
Providers/FortifyServiceProvider.php:84:17
             #[Override]
             public function toResponse($request): Response
             {
-                return response()->view('livewire.auth.confirm-password');
+                
             }
         });
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/PasswordConfirmationTest.php" not found.
