[Killed] PublicVisibility
Services/TeamHierarchyTraversalService.php:21:5
      *
      * Replaces while loop with functional collection pattern.
      */
-    public function isDescendantOf(Team $team, Team $ancestor): bool
+    protected function isDescendantOf(Team $team, Team $ancestor): bool
     {
         return $this->getAncestry($team)
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] PublicVisibility
Services/TeamHierarchyTraversalService.php:58:5
      *
      * @psalm-return Collection<never, never>|\Illuminate\Database\Eloquent\Collection<int, TRelatedModel>
      */
-    public function getDescendants(Team $team): \Illuminate\Database\Eloquent\Collection|Collection
+    protected function getDescendants(Team $team): \Illuminate\Database\Eloquent\Collection|Collection
     {
         $children = $team->children()->withoutGlobalScopes()->get();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamHierarchyTraversalServiceTest.php" not found.

[Killed] IfNegation
Services/TeamHierarchyTraversalService.php:62:9
     {
         $children = $team->children()->withoutGlobalScopes()->get();
 
-        if ($children->isEmpty()) {
-            return collect();
-        }
+        if (!$children->isEmpty()) {
 
         return $children
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamHierarchyTraversalServiceTest.php" not found.

[Killed] ReturnRemoval
Services/TeamHierarchyTraversalService.php:63:13
         $children = $team->children()->withoutGlobalScopes()->get();
 
         if ($children->isEmpty()) {
-            return collect();
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamHierarchyTraversalServiceTest.php" not found.

[Killed] FunctionCall
Services/TeamHierarchyTraversalService.php:63:13
         $children = $team->children()->withoutGlobalScopes()->get();
 
         if ($children->isEmpty()) {
-            return collect();
+            collect();
+            return null;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamHierarchyTraversalServiceTest.php" not found.

[Killed] LogicalNot
Services/TeamHierarchyTraversalService.php:86:9
             ->whereNull('deleted_at')
             ->first();
 
-        if (! $parent) {
+        if ($parent) {
             return collect();
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.

[Killed] LogicalNot
Services/TeamHierarchyTraversalService.php:92:9
 
         $parentModel = Team::query()->withoutGlobalScopes()->find($parent->id);
 
-        if (! $parentModel) {
+        if ($parentModel) {
             return collect();
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.
