[Killed] PublicVisibility
Services/TeamMove/ApprovalDecisionEngine.php:28:5
      *
      * Replaces foreach loop with collection pipeline.
      */
-    public function requiresApproval(Team $team, ?Team $newParent, ?Team $enterprise): bool
+    protected function requiresApproval(Team $team, ?Team $newParent, ?Team $enterprise): bool
     {
         if (! $enterprise instanceof Team) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Services/TeamMove/ApprovalDecisionEngine.php:30:9
      */
     public function requiresApproval(Team $team, ?Team $newParent, ?Team $enterprise): bool
     {
-        if (! $enterprise instanceof Team) {
+        if ($enterprise instanceof Team) {
             return false;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] FalseValue
Services/TeamMove/ApprovalDecisionEngine.php:31:13
     public function requiresApproval(Team $team, ?Team $newParent, ?Team $enterprise): bool
     {
         if (! $enterprise instanceof Team) {
-            return false;
+            return true;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamMove/ApprovalDecisionEngineTest.php" not found.

[Killed] ReturnRemoval
Services/TeamMove/ApprovalDecisionEngine.php:31:13
     public function requiresApproval(Team $team, ?Team $newParent, ?Team $enterprise): bool
     {
         if (! $enterprise instanceof Team) {
-            return false;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamMove/ApprovalDecisionEngineTest.php" not found.
