[Killed] PublicVisibility
Services/TeamMove/ApproverResolverFactory.php:22:5
     /**
      * Get the appropriate approver resolver based on move type.
      */
-    public function getResolver(Team $team, ?Team $newParent): SameOrganisationApproverResolver|CrossOrganisationApproverResolver
+    protected function getResolver(Team $team, ?Team $newParent): SameOrganisationApproverResolver|CrossOrganisationApproverResolver
     {
         if ($this->organisationFinder->isCrossOrganisationMove($team, $newParent)) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IfNegation
Services/TeamMove/ApproverResolverFactory.php:24:9
      */
     public function getResolver(Team $team, ?Team $newParent): SameOrganisationApproverResolver|CrossOrganisationApproverResolver
     {
-        if ($this->organisationFinder->isCrossOrganisationMove($team, $newParent)) {
-            return new CrossOrganisationApproverResolver($this->organisationFinder);
-        }
+        if (!$this->organisationFinder->isCrossOrganisationMove($team, $newParent)) {
 
         return new SameOrganisationApproverResolver($this->organisationFinder);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamMove/ApproverResolverFactory.php:25:13
     public function getResolver(Team $team, ?Team $newParent): SameOrganisationApproverResolver|CrossOrganisationApproverResolver
     {
         if ($this->organisationFinder->isCrossOrganisationMove($team, $newParent)) {
-            return new CrossOrganisationApproverResolver($this->organisationFinder);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] NewObject
Services/TeamMove/ApproverResolverFactory.php:28:9
             return new CrossOrganisationApproverResolver($this->organisationFinder);
         }
 
-        return new SameOrganisationApproverResolver($this->organisationFinder);
+        new SameOrganisationApproverResolver($this->organisationFinder);
+        return null;
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
