[Killed] InstanceOf_
Services/TeamMove/CrossOrganisationApproverResolver.php:31:9
     public function resolve(Team $team, ?Team $newParent): array
     {
         $sourceOrg = $this->organisationFinder->findOrganisation($team);
-        $targetOrg = $newParent instanceof Team
+        $targetOrg = !$newParent instanceof Team ? $this->organisationFinder->findOrganisation($newParent) : null;
             ? $this->organisationFinder->findOrganisation($newParent)
             : null;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Services/TeamMove/CrossOrganisationApproverResolver.php:31:9
     public function resolve(Team $team, ?Team $newParent): array
     {
         $sourceOrg = $this->organisationFinder->findOrganisation($team);
-        $targetOrg = $newParent instanceof Team
-            ? $this->organisationFinder->findOrganisation($newParent)
-            : null;
+        $targetOrg = $newParent instanceof Team ? null : $this->organisationFinder->findOrganisation($newParent);
 
         $approvers = collect();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Services/TeamMove/CrossOrganisationApproverResolver.php:37:9
 
         $approvers = collect();
 
-        if ($sourceOrg instanceof Team) {
+        if (!$sourceOrg instanceof Team) {
             $approvers = $approvers->merge($this->getOrganisationAdmins($sourceOrg));
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalAndNegation
Services/TeamMove/CrossOrganisationApproverResolver.php:41:9
             $approvers = $approvers->merge($this->getOrganisationAdmins($sourceOrg));
         }
 
-        if ($targetOrg && $targetOrg->id !== $sourceOrg?->id) {
+        if (!($targetOrg && $targetOrg->id !== $sourceOrg?->id)) {
             $approvers = $approvers->merge($this->getOrganisationAdmins($targetOrg));
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Services/TeamMove/CrossOrganisationApproverResolver.php:41:9
             $approvers = $approvers->merge($this->getOrganisationAdmins($sourceOrg));
         }
 
-        if ($targetOrg && $targetOrg->id !== $sourceOrg?->id) {
+        if (!$targetOrg && !($targetOrg->id !== $sourceOrg?->id)) {
             $approvers = $approvers->merge($this->getOrganisationAdmins($targetOrg));
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] FunctionCallRemoval
Services/TeamMove/CrossOrganisationApproverResolver.php:56:9
     private function getOrganisationAdmins(Team $organisation): array
     {
         $previousTeamId = getPermissionsTeamId();
-        setPermissionsTeamId($organisation->id);
+        
 
         try {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] UnwrapFinally
Services/TeamMove/CrossOrganisationApproverResolver.php:58:9
         $previousTeamId = getPermissionsTeamId();
         setPermissionsTeamId($organisation->id);
 
-        try {
-            try {
-                return User::query()
-                    ->role('organisation_admin')
-                    ->pluck('id')
-                    ->toArray();
-            } catch (RoleDoesNotExist) {
-                return [];
-            }
-        } finally {
-            setPermissionsTeamId($previousTeamId);
-        }
+        return User::query()->role('organisation_admin')->pluck('id')->toArray();
+        } catch (RoleDoesNotExist) {
+            return [];
+        setPermissionsTeamId($previousTeamId);
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamMove/CrossOrganisationApproverResolver.php:60:17
 
         try {
             try {
-                return User::query()
-                    ->role('organisation_admin')
-                    ->pluck('id')
-                    ->toArray();
+                
             } catch (RoleDoesNotExist) {
                 return [];
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamMove/CrossOrganisationApproverResolver.php:65:17
                     ->pluck('id')
                     ->toArray();
             } catch (RoleDoesNotExist) {
-                return [];
+                
             }
         } finally {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
