[Killed] TrueValue
Services/TeamMove/CrossOrganisationRule.php:20:9
     #[Override]
     public function requiresApproval(Team $team, ?Team $newParent, Team $enterprise): bool
     {
-        if (! ($enterprise->move_approval_require_cross_org ?? true)) {
+        if (!($enterprise->move_approval_require_cross_org ?? false)) {
             return false;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Coalesce
Services/TeamMove/CrossOrganisationRule.php:20:9
     #[Override]
     public function requiresApproval(Team $team, ?Team $newParent, Team $enterprise): bool
     {
-        if (! ($enterprise->move_approval_require_cross_org ?? true)) {
+        if (!(true ?? $enterprise->move_approval_require_cross_org)) {
             return false;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
