[Killed] IncrementInteger
Services/TeamMove/DepthChangeRule.php:15:9
     #[Override]
     public function requiresApproval(Team $team, ?Team $newParent, Team $enterprise): bool
     {
-        $threshold = $enterprise->move_approval_depth_change_threshold ?? 2;
+        $threshold = $enterprise->move_approval_depth_change_threshold ?? 3;
         $currentDepth = $team->getDepth();
         $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Coalesce
Services/TeamMove/DepthChangeRule.php:15:9
     #[Override]
     public function requiresApproval(Team $team, ?Team $newParent, Team $enterprise): bool
     {
-        $threshold = $enterprise->move_approval_depth_change_threshold ?? 2;
+        $threshold = 2 ?? $enterprise->move_approval_depth_change_threshold;
         $currentDepth = $team->getDepth();
         $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] DecrementInteger
Services/TeamMove/DepthChangeRule.php:17:9
     {
         $threshold = $enterprise->move_approval_depth_change_threshold ?? 2;
         $currentDepth = $team->getDepth();
-        $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
+        $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 0 : 1;
         $depthChange = abs($newDepth - $currentDepth);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] DecrementInteger
Services/TeamMove/DepthChangeRule.php:17:9
     {
         $threshold = $enterprise->move_approval_depth_change_threshold ?? 2;
         $currentDepth = $team->getDepth();
-        $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
+        $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 0;
         $depthChange = abs($newDepth - $currentDepth);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Minus
Services/TeamMove/DepthChangeRule.php:18:9
         $threshold = $enterprise->move_approval_depth_change_threshold ?? 2;
         $currentDepth = $team->getDepth();
         $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
-        $depthChange = abs($newDepth - $currentDepth);
+        $depthChange = abs($newDepth + $currentDepth);
 
         return $depthChange >= $threshold;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] GreaterThanOrEqualTo
Services/TeamMove/DepthChangeRule.php:20:9
         $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
         $depthChange = abs($newDepth - $currentDepth);
 
-        return $depthChange >= $threshold;
+        return $depthChange > $threshold;
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] GreaterThanOrEqualToNegotiation
Services/TeamMove/DepthChangeRule.php:20:9
         $newDepth = $newParent instanceof Team ? $newParent->getDepth() + 1 : 1;
         $depthChange = abs($newDepth - $currentDepth);
 
-        return $depthChange >= $threshold;
+        return $depthChange < $threshold;
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
