[Killed] IncrementInteger
Services/TeamMove/DescendantCountRule.php:15:9
     #[Override]
     public function requiresApproval(Team $team, ?Team $newParent, Team $enterprise): bool
     {
-        $threshold = $enterprise->move_approval_descendant_threshold ?? 10;
+        $threshold = $enterprise->move_approval_descendant_threshold ?? 11;
         $descendantCount = $this->getDescendantCount($team);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] DecrementInteger
Services/TeamMove/DescendantCountRule.php:15:9
     #[Override]
     public function requiresApproval(Team $team, ?Team $newParent, Team $enterprise): bool
     {
-        $threshold = $enterprise->move_approval_descendant_threshold ?? 10;
+        $threshold = $enterprise->move_approval_descendant_threshold ?? 9;
         $descendantCount = $this->getDescendantCount($team);
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] GreaterThanOrEqualToNegotiation
Services/TeamMove/DescendantCountRule.php:18:9
         $threshold = $enterprise->move_approval_descendant_threshold ?? 10;
         $descendantCount = $this->getDescendantCount($team);
 
-        return $descendantCount >= $threshold;
+        return $descendantCount < $threshold;
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] GreaterThanOrEqualTo
Services/TeamMove/DescendantCountRule.php:18:9
         $threshold = $enterprise->move_approval_descendant_threshold ?? 10;
         $descendantCount = $this->getDescendantCount($team);
 
-        return $descendantCount >= $threshold;
+        return $descendantCount > $threshold;
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] DecrementInteger
Services/TeamMove/DescendantCountRule.php:33:13
         return $team->children()
             ->withoutGlobalScopes()
             ->get()
-            ->sum(fn (Team $child): int => 1 + $this->getDescendantCount($child)
+            return $team->children()->withoutGlobalScopes()->get()->sum(fn(Team $child): int => 0 + $this->getDescendantCount($child));
             );
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IncrementInteger
Services/TeamMove/DescendantCountRule.php:33:13
         return $team->children()
             ->withoutGlobalScopes()
             ->get()
-            ->sum(fn (Team $child): int => 1 + $this->getDescendantCount($child)
+            return $team->children()->withoutGlobalScopes()->get()->sum(fn(Team $child): int => 2 + $this->getDescendantCount($child));
             );
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
