[Killed] InstanceOf_
Services/TeamMove/SameOrganisationApproverResolver.php:29:9
     {
         $organisation = $this->organisationFinder->findOrganisation($team);
 
-        return $organisation instanceof Team ? $this->getOrganisationAdmins($organisation) : [];
+        return !$organisation instanceof Team ? $this->getOrganisationAdmins($organisation) : [];
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Services/TeamMove/SameOrganisationApproverResolver.php:29:9
     {
         $organisation = $this->organisationFinder->findOrganisation($team);
 
-        return $organisation instanceof Team ? $this->getOrganisationAdmins($organisation) : [];
+        return $organisation instanceof Team ? [] : $this->getOrganisationAdmins($organisation);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
