[Killed] PublicVisibility
Services/TeamMove/TeamMoveApprovalService.php:31:5
      *
      * @return Result<bool, string>
      */
-    public function approve(TeamMoveApproval $approval, User $approver): Result
+    protected function approve(TeamMoveApproval $approval, User $approver): Result
     {
         return Result::try(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMove/TeamMoveApprovalService.php:38:17
              * @return true
              */
             function () use ($approval, $approver): bool {
-                $this->validateApprovalRequest($approval, $approver);
+                
 
                 return true;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Services/TeamMove/TeamMoveApprovalService.php:42:13
 
                 return true;
             },
-            ['Validating approval request']
+            []
         )->flatMap(fn (): Result => Result::try(
             fn (): bool => DB::transaction(/**
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMove/TeamMoveApprovalService.php:48:21
              * @return true
              */
                 function () use ($approval, $approver): bool {
-                    $this->recordApproval($approval, $approver);
+                    
 
                     // If all approvers have approved, we need to execute the move
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IfNegation
Services/TeamMove/TeamMoveApprovalService.php:53:21
                     // If all approvers have approved, we need to execute the move
                     // But executeMove returns Result, and we're in a transaction
                     // So we'll call it and unwrap the Result (throwing on failure to rollback transaction)
-                    if ($this->allApproversHaveApproved($approval)) {
-                        $executeResult = $this->executeMove($approval);
-                        if ($executeResult->isFailure) {
-                            // Throw to rollback transaction - Result::try will catch and convert to failure Result
-                            throw new RuntimeException($executeResult->error);
-                        }
-                    }
+                    if (!$this->allApproversHaveApproved($approval)) {
 
                     $approval->save();
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMove/TeamMoveApprovalService.php:61:21
                         }
                     }
 
-                    $approval->save();
+                    
 
                     return true;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] PublicVisibility
Services/TeamMove/TeamMoveApprovalService.php:72:5
     /**
      * Reject a team move request.
      */
-    public function reject(TeamMoveApproval $approval, User $rejector, string $reason): void
+    protected function reject(TeamMoveApproval $approval, User $rejector, string $reason): void
     {
         $this->validateRejectionRequest($approval, $rejector);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMove/TeamMoveApprovalService.php:74:9
      */
     public function reject(TeamMoveApproval $approval, User $rejector, string $reason): void
     {
-        $this->validateRejectionRequest($approval, $rejector);
+        
 
         $approval->update([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMove/TeamMoveApprovalService.php:76:9
     {
         $this->validateRejectionRequest($approval, $rejector);
 
-        $approval->update([
-            'status' => 'rejected',
-            'rejected_at' => now(),
-            'rejected_by_id' => $rejector->id,
-            'rejection_reason' => $reason,
-        ]);
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Services/TeamMove/TeamMoveApprovalService.php:76:9
     {
         $this->validateRejectionRequest($approval, $rejector);
 
-        $approval->update([
-            'status' => 'rejected',
-            'rejected_at' => now(),
-            'rejected_by_id' => $rejector->id,
-            'rejection_reason' => $reason,
-        ]);
+        $approval->update(['rejected_at' => now(), 'rejected_by_id' => $rejector->id, 'rejection_reason' => $reason]);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Coalesce
Services/TeamMove/TeamMoveApprovalService.php:89:9
      */
     private function allApproversHaveApproved(TeamMoveApproval $approval): bool
     {
-        $requiredApprovers = collect($approval->required_approvers ?? []);
+        $requiredApprovers = collect([] ?? $approval->required_approvers);
         $approvedUserIds = collect($approval->approvals ?? [])
             ->pluck('user_id');
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Coalesce
Services/TeamMove/TeamMoveApprovalService.php:90:9
     private function allApproversHaveApproved(TeamMoveApproval $approval): bool
     {
         $requiredApprovers = collect($approval->required_approvers ?? []);
-        $approvedUserIds = collect($approval->approvals ?? [])
+        $approvedUserIds = collect([] ?? $approval->approvals)->pluck('user_id');
             ->pluck('user_id');
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Services/TeamMove/TeamMoveApprovalService.php:94:9
             ->pluck('user_id');
 
         // Use collection intersection to check if all required have approved
-        return $requiredApprovers->intersect($approvedUserIds)->count() === $requiredApprovers->count();
+        return $requiredApprovers->intersect($approvedUserIds)->count() !== $requiredApprovers->count();
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalNot
Services/TeamMove/TeamMoveApprovalService.php:102:9
      */
     private function validateApprovalRequest(TeamMoveApproval $approval, User $approver): void
     {
-        if (! $approval->isPending()) {
+        if ($approval->isPending()) {
             throw ValidationException::withMessages([
                 'approval' => ['This approval request is no longer pending.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Coalesce
Services/TeamMove/TeamMoveApprovalService.php:108:9
             ]);
         }
 
-        $requiredApprovers = collect($approval->required_approvers ?? []);
+        $requiredApprovers = collect([] ?? $approval->required_approvers);
         if ($requiredApprovers->doesntContain($approver->id)) {
             throw ValidationException::withMessages([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IfNegation
Services/TeamMove/TeamMoveApprovalService.php:109:9
         }
 
         $requiredApprovers = collect($approval->required_approvers ?? []);
-        if ($requiredApprovers->doesntContain($approver->id)) {
-            throw ValidationException::withMessages([
-                'approver' => ['You are not authorized to approve this request.'],
-            ]);
-        }
+        if (!$requiredApprovers->doesntContain($approver->id)) {
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Throw_
Services/TeamMove/TeamMoveApprovalService.php:110:13
 
         $requiredApprovers = collect($approval->required_approvers ?? []);
         if ($requiredApprovers->doesntContain($approver->id)) {
-            throw ValidationException::withMessages([
-                'approver' => ['You are not authorized to approve this request.'],
-            ]);
+            ValidationException::withMessages(['approver' => ['You are not authorized to approve this request.']]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Services/TeamMove/TeamMoveApprovalService.php:110:13
 
         $requiredApprovers = collect($approval->required_approvers ?? []);
         if ($requiredApprovers->doesntContain($approver->id)) {
-            throw ValidationException::withMessages([
-                'approver' => ['You are not authorized to approve this request.'],
-            ]);
+            throw ValidationException::withMessages([]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Services/TeamMove/TeamMoveApprovalService.php:111:17
         $requiredApprovers = collect($approval->required_approvers ?? []);
         if ($requiredApprovers->doesntContain($approver->id)) {
             throw ValidationException::withMessages([
-                'approver' => ['You are not authorized to approve this request.'],
+                throw ValidationException::withMessages(['approver' => []]);
             ]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] IfNegation
Services/TeamMove/TeamMoveApprovalService.php:128:9
         }
 
         $requiredApprovers = collect($approval->required_approvers ?? []);
-        if ($requiredApprovers->doesntContain($rejector->id)) {
-            throw ValidationException::withMessages([
-                'rejector' => ['You are not authorized to reject this request.'],
-            ]);
-        }
+        if (!$requiredApprovers->doesntContain($rejector->id)) {
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Coalesce
Services/TeamMove/TeamMoveApprovalService.php:142:9
      */
     private function recordApproval(TeamMoveApproval $approval, User $approver): void
     {
-        $approval->approvals = collect($approval->approvals ?? [])
+        $approval->approvals = collect([] ?? $approval->approvals)->push(['user_id' => $approver->id, 'approved_at' => now()->toISOString(), 'status' => 'approved'])->all();
             ->push([
                 'user_id' => $approver->id,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Services/TeamMove/TeamMoveApprovalService.php:159:9
     private function executeMove(TeamMoveApproval $approval): Result
     {
         $team = Team::query()->withoutGlobalScopes()->find($approval->team_id);
-        if (! $team instanceof Team) {
+        if ($team instanceof Team) {
             return Result::failure('Team not found for approval', ['Team move execution failed']);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] TrueValue
Services/TeamMove/TeamMoveApprovalService.php:170:13
             $approval->status = 'approved';
             $approval->approved_at = now();
 
-            return Result::success(true, ['Team move executed and approval marked as complete']);
+            return Result::success(false, ['Team move executed and approval marked as complete']);
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
