[Killed] PublicVisibility
Services/TeamMove/TeamMoveRequestService.php:31:5
      *
      * @return Result<TeamMoveApproval|Team, string>
      */
-    public function requestMove(
+    protected function requestMove(Team $team, ?int $newParentId, User $requestedBy, ?string $reason = null): Result
         Team $team,
         ?int $newParentId,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Services/TeamMove/TeamMoveRequestService.php:37:9
         User $requestedBy,
         ?string $reason = null,
     ): Result {
-        $newParent = $newParentId ? Team::query()->withoutGlobalScopes()->find($newParentId) : null;
+        $newParent = $newParentId ? null : Team::query()->withoutGlobalScopes()->find($newParentId);
         $enterprise = $team->tenant;
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalNot
Services/TeamMove/TeamMoveRequestService.php:41:9
         $enterprise = $team->tenant;
 
         // Use decision engine
-        if (! $this->approvalEngine->requiresApproval($team, $newParent, $enterprise)) {
+        if ($this->approvalEngine->requiresApproval($team, $newParent, $enterprise)) {
             // Move doesn't require approval - execute immediately and return handler's Result
             $moveCommand = new MoveTeamCommand($team, $newParentId);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Services/TeamMove/TeamMoveRequestService.php:49:17
             // Return the handler's Result directly (it's already Result<Team>)
             return $moveResult->flatMap(static function (Team $movedTeam): Result {
                 $fresh = $movedTeam->fresh();
-                if (! $fresh instanceof Team) {
+                if ($fresh instanceof Team) {
                     return Result::failure('Team not found after move', ['Team move completed but refresh failed']);
                 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamMove/TeamMoveRequestService.php:53:17
                     return Result::failure('Team not found after move', ['Team move completed but refresh failed']);
                 }
 
-                return Result::success($fresh, ['Team moved successfully']);
+                
             });
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ArrayItemRemoval
Services/TeamMove/TeamMoveRequestService.php:53:17
                     return Result::failure('Team not found after move', ['Team move completed but refresh failed']);
                 }
 
-                return Result::success($fresh, ['Team moved successfully']);
+                return Result::success($fresh, []);
             });
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
