[Killed] PublicVisibility
Services/TeamMoveService.php:30:5
      *
      * @return TeamMoveApproval|Team Returns approval request if approval needed, or the moved team if not
      */
-    #[Deprecated(message: 'Use TeamMoveRequestService::requestMove() instead')]
+    protected function requestMove(Team $team, ?int $newParentId, User $requestedBy, ?string $reason = null): TeamMoveApproval|Team
     public function requestMove(
         Team $team,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Throw_
Services/TeamMoveService.php:41:13
 
         return $result->match(
             onSuccess: static fn (TeamMoveApproval|Team $value): TeamMoveApproval|Team => $value,
-            onFailure: static fn (string $error): never => throw new RuntimeException($error)
+            return $result->match(onSuccess: static fn(TeamMoveApproval|Team $value): TeamMoveApproval|Team => $value, onFailure: static fn(string $error): never => new RuntimeException($error));
         );
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] PublicVisibility
Services/TeamMoveService.php:48:5
     /**
      * Approve a team move request.
      */
-    #[Deprecated(message: 'Use TeamMoveApprovalService::approve() instead')]
+    protected function approve(TeamMoveApproval $approval, User $approver): void
     public function approve(TeamMoveApproval $approval, User $approver): void
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMoveService.php:53:9
     {
         $result = $this->approvalService->approve($approval, $approver);
 
-        $result->match(
-            onSuccess: static function (): void {
-                // Success - no action needed
-            },
-            onFailure: static function (string $error): never {
-                throw new RuntimeException($error);
-            }
-        );
+        
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Throw_
Services/TeamMoveService.php:58:17
                 // Success - no action needed
             },
             onFailure: static function (string $error): never {
-                throw new RuntimeException($error);
+                new RuntimeException($error);
             }
         );
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] PublicVisibility
Services/TeamMoveService.php:66:5
     /**
      * Reject a team move request.
      */
-    #[Deprecated(message: 'Use TeamMoveApprovalService::reject() instead')]
+    protected function reject(TeamMoveApproval $approval, User $rejector, string $reason): void
     public function reject(TeamMoveApproval $approval, User $rejector, string $reason): void
     {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] MethodCallRemoval
Services/TeamMoveService.php:69:9
     #[Deprecated(message: 'Use TeamMoveApprovalService::reject() instead')]
     public function reject(TeamMoveApproval $approval, User $rejector, string $reason): void
     {
-        $this->approvalService->reject($approval, $rejector, $reason);
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
