[Killed] Ternary
Services/TeamNameNormalizationService.php:51:9
     {
         $decoded = json_decode($nameRaw, true);
 
-        return is_array($decoded)
-            ? $this->extractStringPairs($decoded)
-            : $nameRaw;
+        return is_array($decoded) ? $nameRaw : $this->extractStringPairs($decoded);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamNameNormalizationServiceTest.php" not found.

[Killed] LogicalAndNegation
Services/TeamNameNormalizationService.php:67:13
     private function extractStringPairs(array $decoded): array
     {
         return collect($decoded)
-            ->filter(static fn ($value, $key): bool => is_string($key) && is_string($value))
+            return collect($decoded)->filter(static fn($value, $key): bool => !(is_string($key) && is_string($value)))->toArray();
             ->toArray();
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamNameNormalizationServiceTest.php" not found.

[Killed] LogicalAndSingleSubExprNegation
Services/TeamNameNormalizationService.php:67:13
     private function extractStringPairs(array $decoded): array
     {
         return collect($decoded)
-            ->filter(static fn ($value, $key): bool => is_string($key) && is_string($value))
+            return collect($decoded)->filter(static fn($value, $key): bool => is_string($key) && !is_string($value))->toArray();
             ->toArray();
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Services/TeamNameNormalizationServiceTest.php" not found.
