[Killed] PublicVisibility
Services/TeamOrganisationFinderService.php:21:5
      *
      * Replaces while loop with functional collection pattern.
      */
-    public function findOrganisation(Team $team): ?Team
+    protected function findOrganisation(Team $team): ?Team
     {
         // Check if the team itself is an organisation
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Services/TeamOrganisationFinderService.php:24:9
     public function findOrganisation(Team $team): ?Team
     {
         // Check if the team itself is an organisation
-        if ($team->type === TeamType::ORGANISATION) {
+        if ($team->type !== TeamType::ORGANISATION) {
             return $team;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamOrganisationFinderService.php:25:13
     {
         // Check if the team itself is an organisation
         if ($team->type === TeamType::ORGANISATION) {
-            return $team;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Services/TeamOrganisationFinderService.php:29:13
         }
 
         return $this->getAncestry($team)
-            ->first(static fn (Team $ancestor): bool => $ancestor->type === TeamType::ORGANISATION);
+            return $this->getAncestry($team)->first(static fn(Team $ancestor): bool => $ancestor->type !== TeamType::ORGANISATION);
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] PublicVisibility
Services/TeamOrganisationFinderService.php:35:5
     /**
      * Check if a move is cross-organisation using collection comparison.
      */
-    public function isCrossOrganisationMove(Team $team, ?Team $newParent): bool
+    protected function isCrossOrganisationMove(Team $team, ?Team $newParent): bool
     {
         $sourceOrg = $this->findOrganisation($team);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Ternary
Services/TeamOrganisationFinderService.php:38:9
     public function isCrossOrganisationMove(Team $team, ?Team $newParent): bool
     {
         $sourceOrg = $this->findOrganisation($team);
-        $targetOrg = $newParent instanceof Team ? $this->findOrganisation($newParent) : null;
+        $targetOrg = $newParent instanceof Team ? null : $this->findOrganisation($newParent);
 
         if (! $sourceOrg || ! $targetOrg) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Services/TeamOrganisationFinderService.php:38:9
     public function isCrossOrganisationMove(Team $team, ?Team $newParent): bool
     {
         $sourceOrg = $this->findOrganisation($team);
-        $targetOrg = $newParent instanceof Team ? $this->findOrganisation($newParent) : null;
+        $targetOrg = !$newParent instanceof Team ? $this->findOrganisation($newParent) : null;
 
         if (! $sourceOrg || ! $targetOrg) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalNot
Services/TeamOrganisationFinderService.php:40:9
         $sourceOrg = $this->findOrganisation($team);
         $targetOrg = $newParent instanceof Team ? $this->findOrganisation($newParent) : null;
 
-        if (! $sourceOrg || ! $targetOrg) {
+        if ($sourceOrg || !$targetOrg) {
             return false;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] LogicalNot
Services/TeamOrganisationFinderService.php:40:9
         $sourceOrg = $this->findOrganisation($team);
         $targetOrg = $newParent instanceof Team ? $this->findOrganisation($newParent) : null;
 
-        if (! $sourceOrg || ! $targetOrg) {
+        if (!$sourceOrg || $targetOrg) {
             return false;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] FalseValue
Services/TeamOrganisationFinderService.php:41:13
         $targetOrg = $newParent instanceof Team ? $this->findOrganisation($newParent) : null;
 
         if (! $sourceOrg || ! $targetOrg) {
-            return false;
+            return true;
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamOrganisationFinderService.php:41:13
         $targetOrg = $newParent instanceof Team ? $this->findOrganisation($newParent) : null;
 
         if (! $sourceOrg || ! $targetOrg) {
-            return false;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] NotIdentical
Services/TeamOrganisationFinderService.php:44:9
             return false;
         }
 
-        return $sourceOrg->id !== $targetOrg->id;
+        return $sourceOrg->id === $targetOrg->id;
     }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] InstanceOf_
Services/TeamOrganisationFinderService.php:62:9
      */
     private function buildAncestryUntilOrganisation(?Team $current): Collection
     {
-        if (! $current instanceof Team) {
+        if ($current instanceof Team) {
             return collect();
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamOrganisationFinderService.php:63:13
     private function buildAncestryUntilOrganisation(?Team $current): Collection
     {
         if (! $current instanceof Team) {
-            return collect();
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] Identical
Services/TeamOrganisationFinderService.php:66:9
             return collect();
         }
 
-        if ($current->type === TeamType::ORGANISATION) {
+        if ($current->type !== TeamType::ORGANISATION) {
             return collect([$current]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.

[Killed] ReturnRemoval
Services/TeamOrganisationFinderService.php:67:13
         }
 
         if ($current->type === TeamType::ORGANISATION) {
-            return collect([$current]);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamMoveApprovalTest.php" not found.
