[Killed] PublicVisibility
Services/UserProtectionService.php:26:5
      *
      * Uses collection contains for functional approach.
      */
-    public function isProtectable(User $user): bool
+    protected function isProtectable(User $user): bool
     {
         $userKeyRoles = $this->getUserKeyRoles($user);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] LessThanOrEqualToNegotiation
Services/UserProtectionService.php:70:9
             ->where($teamKey, $row->team_id)
             ->count();
 
-        return $count <= 1;
+        return $count > 1;
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.

[Killed] LessThanOrEqualTo
Services/UserProtectionService.php:70:9
             ->where($teamKey, $row->team_id)
             ->count();
 
-        return $count <= 1;
+        return $count < 1;
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UserDeletionConstraintTest.php" not found.
