[Killed] PublicVisibility
Support/Html/TeamBioRenderer.php:28:5
      * @param  string|null  $bio  The markdown bio text
      * @return array|null|string The rendered HTML or null if bio is empty
      */
-    public function render(?string $bio): array|string|null
+    protected function render(?string $bio): array|string|null
     {
         if ($bio === null || $bio === '') {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] Identical
Support/Html/TeamBioRenderer.php:30:9
      */
     public function render(?string $bio): array|string|null
     {
-        if ($bio === null || $bio === '') {
+        if ($bio === null || $bio !== '') {
             return null;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] Identical
Support/Html/TeamBioRenderer.php:30:9
      */
     public function render(?string $bio): array|string|null
     {
-        if ($bio === null || $bio === '') {
+        if ($bio !== null || $bio === '') {
             return null;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] ReturnRemoval
Support/Html/TeamBioRenderer.php:31:13
     public function render(?string $bio): array|string|null
     {
         if ($bio === null || $bio === '') {
-            return null;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Html/TeamBioRendererTest.php" not found.

[Killed] ReturnRemoval
Support/Html/TeamBioRenderer.php:39:13
         try {
             $html = $this->markdownRenderer->toHtml($bio);
 
-            return Purify::clean($html);
+            
         } catch (BindingResolutionException $e) {
             // If config resolution fails (can happen during mutation testing),
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/TeamBioTest.php" not found.

[Killed] IfNegation
Support/Html/TeamBioRenderer.php:44:13
             // If config resolution fails (can happen during mutation testing),
             // return null to prevent the error from propagating
             // This is a graceful degradation for mutation testing scenarios
-            if (str_contains($e->getMessage(), 'Target class [config] does not exist')) {
-                return null;
-            }
+            if (!str_contains($e->getMessage(), 'Target class [config] does not exist')) {
 
             throw $e;
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Html/TeamBioRendererTest.php" not found.

[Killed] ReturnRemoval
Support/Html/TeamBioRenderer.php:45:17
             // return null to prevent the error from propagating
             // This is a graceful degradation for mutation testing scenarios
             if (str_contains($e->getMessage(), 'Target class [config] does not exist')) {
-                return null;
+                
             }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Html/TeamBioRendererTest.php" not found.

[Killed] Throw_
Support/Html/TeamBioRenderer.php:48:13
                 return null;
             }
 
-            throw $e;
+            $e;
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Html/TeamBioRendererTest.php" not found.
