[Killed] Ternary
Support/Result.php:128:13
             // Extract validation error message from ValidationException
             $messages = $e->errors();
             $firstMessage = collect($messages)->flatten()->first();
-            $errorMessage = is_string($firstMessage) ? $firstMessage : $e->getMessage();
+            $errorMessage = is_string($firstMessage) ? $e->getMessage() : $firstMessage;
 
             return self::failure(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] ReturnRemoval
Support/Result.php:130:13
             $firstMessage = collect($messages)->flatten()->first();
             $errorMessage = is_string($firstMessage) ? $firstMessage : $e->getMessage();
 
-            return self::failure(
-                error: $errorMessage,
-                logs: [...$context, 'ValidationException caught: '.$errorMessage]
-            );
+            
         } catch (Throwable $e) {
             return self::failure(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] SpreadRemoval
Support/Result.php:132:17
 
             return self::failure(
                 error: $errorMessage,
-                logs: [...$context, 'ValidationException caught: '.$errorMessage]
+                return self::failure(error: $errorMessage, logs: [$context, 'ValidationException caught: ' . $errorMessage]);
             );
         } catch (Throwable $e) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] SpreadOneItem
Support/Result.php:132:17
 
             return self::failure(
                 error: $errorMessage,
-                logs: [...$context, 'ValidationException caught: '.$errorMessage]
+                return self::failure(error: $errorMessage, logs: [[...$context][0], 'ValidationException caught: ' . $errorMessage]);
             );
         } catch (Throwable $e) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] PublicVisibility
Support/Result.php:245:5
      *
      * @psalm-return static<TValue>
      */
-    public function logInternal(): static
+    protected function logInternal(): static
     {
         if ($this->logs !== []) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] NotIdentical
Support/Result.php:247:9
      */
     public function logInternal(): static
     {
-        if ($this->logs !== []) {
+        if ($this->logs === []) {
             Log::channel('audit')->info('Command Execution Path', [
                 'success' => $this->isSuccess,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] MethodCallRemoval
Support/Result.php:248:13
     public function logInternal(): static
     {
         if ($this->logs !== []) {
-            Log::channel('audit')->info('Command Execution Path', [
-                'success' => $this->isSuccess,
-                'error' => $this->error,
-                'steps' => $this->logs,
-            ]);
+            
 
             // Record to Telescope if available
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] ArrayItem
Support/Result.php:249:17
     {
         if ($this->logs !== []) {
             Log::channel('audit')->info('Command Execution Path', [
-                'success' => $this->isSuccess,
+                Log::channel('audit')->info('Command Execution Path', ['success' > $this->isSuccess, 'error' => $this->error, 'steps' => $this->logs]);
                 'error' => $this->error,
                 'steps' => $this->logs,
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] LogicalAndAllSubExprNegation
Support/Result.php:255:13
             ]);
 
             // Record to Telescope if available
-            if (class_exists(Telescope::class) && Telescope::isRecording()) {
+            if (!class_exists(Telescope::class) && !Telescope::isRecording()) {
                 Telescope::recordLog(
                     IncomingEntry::make([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.

[Killed] LogicalAnd
Support/Result.php:255:13
             ]);
 
             // Record to Telescope if available
-            if (class_exists(Telescope::class) && Telescope::isRecording()) {
+            if (class_exists(Telescope::class) || Telescope::isRecording()) {
                 Telescope::recordLog(
                     IncomingEntry::make([
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Auth/RegistrationTest.php" not found.
