[Killed] LogicalNot
Support/Validation/TeamHierarchy/CycleValidator.php:21:9
     #[Override]
     public function validate(Team $team): void
     {
-        if (! $team->id) {
+        if ($team->id) {
             return;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] ReturnRemoval
Support/Validation/TeamHierarchy/CycleValidator.php:22:13
     public function validate(Team $team): void
     {
         if (! $team->id) {
-            return;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.

[Killed] Identical
Support/Validation/TeamHierarchy/CycleValidator.php:25:9
             return;
         }
 
-        if ((int) $team->parent_id === (int) $team->id) {
+        if ((int) $team->parent_id !== (int) $team->id) {
             throw ValidationException::withMessages([
                 'parent_id' => ['A team cannot be its own parent.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] CastInt
Support/Validation/TeamHierarchy/CycleValidator.php:25:9
             return;
         }
 
-        if ((int) $team->parent_id === (int) $team->id) {
+        if ((int) $team->parent_id === $team->id) {
             throw ValidationException::withMessages([
                 'parent_id' => ['A team cannot be its own parent.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] Throw_
Support/Validation/TeamHierarchy/CycleValidator.php:26:13
         }
 
         if ((int) $team->parent_id === (int) $team->id) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['A team cannot be its own parent.'],
-            ]);
+            ValidationException::withMessages(['parent_id' => ['A team cannot be its own parent.']]);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/CycleValidatorTest.php" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/CycleValidator.php:27:17
 
         if ((int) $team->parent_id === (int) $team->id) {
             throw ValidationException::withMessages([
-                'parent_id' => ['A team cannot be its own parent.'],
+                throw ValidationException::withMessages(['parent_id' => []]);
             ]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/CycleValidatorTest.php" not found.

[Killed] Identical
Support/Validation/TeamHierarchy/CycleValidator.php:33:9
 
         // Get the new parent (use the parent_id that's being set, not the relationship)
         $newParentId = $team->parent_id;
-        if ($newParentId === null) {
+        if ($newParentId !== null) {
             return; // No parent, no cycle possible
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] LogicalAndNegation
Support/Validation/TeamHierarchy/CycleValidator.php:44:9
             ->whereNull('deleted_at')
             ->first();
 
-        if ($newParent && $this->traversalService->isDescendantOf($newParent, $team)) {
+        if (!($newParent && $this->traversalService->isDescendantOf($newParent, $team))) {
             throw ValidationException::withMessages([
                 'parent_id' => ['A team cannot be moved into its own descendant (would create a cycle).'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] LogicalAnd
Support/Validation/TeamHierarchy/CycleValidator.php:44:9
             ->whereNull('deleted_at')
             ->first();
 
-        if ($newParent && $this->traversalService->isDescendantOf($newParent, $team)) {
+        if ($newParent || $this->traversalService->isDescendantOf($newParent, $team)) {
             throw ValidationException::withMessages([
                 'parent_id' => ['A team cannot be moved into its own descendant (would create a cycle).'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] Throw_
Support/Validation/TeamHierarchy/CycleValidator.php:45:13
             ->first();
 
         if ($newParent && $this->traversalService->isDescendantOf($newParent, $team)) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['A team cannot be moved into its own descendant (would create a cycle).'],
-            ]);
+            ValidationException::withMessages(['parent_id' => ['A team cannot be moved into its own descendant (would create a cycle).']]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/CycleValidatorTest.php" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/CycleValidator.php:45:13
             ->first();
 
         if ($newParent && $this->traversalService->isDescendantOf($newParent, $team)) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['A team cannot be moved into its own descendant (would create a cycle).'],
-            ]);
+            throw ValidationException::withMessages([]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/CycleValidatorTest.php" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/CycleValidator.php:46:17
 
         if ($newParent && $this->traversalService->isDescendantOf($newParent, $team)) {
             throw ValidationException::withMessages([
-                'parent_id' => ['A team cannot be moved into its own descendant (would create a cycle).'],
+                throw ValidationException::withMessages(['parent_id' => []]);
             ]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/CycleValidatorTest.php" not found.
