[Killed] ReturnRemoval
Support/Validation/TeamHierarchy/DepthValidator.php:24:13
         $parent = $team->parent;
 
         if (! $parent) {
-            return;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/DepthValidatorTest.php" not found.

[Killed] GreaterThanOrEqualToNegotiation
Support/Validation/TeamHierarchy/DepthValidator.php:27:9
             return;
         }
 
-        if ($this->traversalService->getDepth($parent) >= 10) {
+        if ($this->traversalService->getDepth($parent) < 10) {
             throw ValidationException::withMessages([
                 'parent_id' => ['Team hierarchy depth cannot exceed 10 levels.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] GreaterThanOrEqualTo
Support/Validation/TeamHierarchy/DepthValidator.php:27:9
             return;
         }
 
-        if ($this->traversalService->getDepth($parent) >= 10) {
+        if ($this->traversalService->getDepth($parent) > 10) {
             throw ValidationException::withMessages([
                 'parent_id' => ['Team hierarchy depth cannot exceed 10 levels.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.
