[Killed] LogicalAndNegation
Support/Validation/TeamHierarchy/EnterpriseParentValidator.php:17:9
     #[Override]
     public function validate(Team $team): void
     {
-        if ($team->type === TeamType::ENTERPRISE && $team->parent_id !== null) {
+        if (!($team->type === TeamType::ENTERPRISE && $team->parent_id !== null)) {
             throw ValidationException::withMessages([
                 'parent_id' => ['Enterprises cannot have a parent team.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] Identical
Support/Validation/TeamHierarchy/EnterpriseParentValidator.php:17:9
     #[Override]
     public function validate(Team $team): void
     {
-        if ($team->type === TeamType::ENTERPRISE && $team->parent_id !== null) {
+        if ($team->type !== TeamType::ENTERPRISE && $team->parent_id !== null) {
             throw ValidationException::withMessages([
                 'parent_id' => ['Enterprises cannot have a parent team.'],
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] Throw_
Support/Validation/TeamHierarchy/EnterpriseParentValidator.php:18:13
     public function validate(Team $team): void
     {
         if ($team->type === TeamType::ENTERPRISE && $team->parent_id !== null) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['Enterprises cannot have a parent team.'],
-            ]);
+            ValidationException::withMessages(['parent_id' => ['Enterprises cannot have a parent team.']]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/EnterpriseParentValidator.php:18:13
     public function validate(Team $team): void
     {
         if ($team->type === TeamType::ENTERPRISE && $team->parent_id !== null) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['Enterprises cannot have a parent team.'],
-            ]);
+            throw ValidationException::withMessages([]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/EnterpriseParentValidator.php:19:17
     {
         if ($team->type === TeamType::ENTERPRISE && $team->parent_id !== null) {
             throw ValidationException::withMessages([
-                'parent_id' => ['Enterprises cannot have a parent team.'],
+                throw ValidationException::withMessages(['parent_id' => []]);
             ]);
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move (Tests\Feature\Teams\TeamMove)" not found.
