[Killed] Throw_
Support/Validation/TeamHierarchy/ParentTypeValidator.php:24:13
         };
 
         if ($requiresParent && $team->parent_id === null) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['This team type requires a parent team.'],
-            ]);
+            ValidationException::withMessages(['parent_id' => ['This team type requires a parent team.']]);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/ParentTypeValidatorTest.php" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/ParentTypeValidator.php:24:13
         };
 
         if ($requiresParent && $team->parent_id === null) {
-            throw ValidationException::withMessages([
-                'parent_id' => ['This team type requires a parent team.'],
-            ]);
+            throw ValidationException::withMessages([]);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamHierarchy/ParentTypeValidatorTest.php" not found.

[Killed] Throw_
Support/Validation/TeamHierarchy/ParentTypeValidator.php:50:13
         };
 
         if ($validParentType && $parent->type !== $validParentType) {
-            throw ValidationException::withMessages([
-                'parent_id' => [
-                    "{$team->type->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.",
-                ],
-            ]);
+            ValidationException::withMessages(['parent_id' => ["{$team->type->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}."]]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move Cycle Prevention (Tests\Feature\Teams\TeamMoveCyclePrevention)" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchy/ParentTypeValidator.php:50:13
         };
 
         if ($validParentType && $parent->type !== $validParentType) {
-            throw ValidationException::withMessages([
-                'parent_id' => [
-                    "{$team->type->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.",
-                ],
-            ]);
+            throw ValidationException::withMessages([]);
         }
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/Team Move Cycle Prevention (Tests\Feature\Teams\TeamMoveCyclePrevention)" not found.
