[Killed] PublicVisibility
Support/Validation/TeamHierarchyValidator.php:20:5
      * @param  Team|null  $parent  The parent team (null for Enterprise)
      * @return Result<bool, string>
      */
-    public static function validate(TeamType $childType, ?Team $parent): Result
+    protected static function validate(TeamType $childType, ?Team $parent): Result
     {
         // 1. Enterprise Rule
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] Identical
Support/Validation/TeamHierarchyValidator.php:23:9
     public static function validate(TeamType $childType, ?Team $parent): Result
     {
         // 1. Enterprise Rule
-        if ($childType === TeamType::ENTERPRISE) {
+        if ($childType !== TeamType::ENTERPRISE) {
             if ($parent instanceof Team) {
                 return Result::failure(
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] InstanceOf_
Support/Validation/TeamHierarchyValidator.php:24:13
     {
         // 1. Enterprise Rule
         if ($childType === TeamType::ENTERPRISE) {
-            if ($parent instanceof Team) {
+            if (!$parent instanceof Team) {
                 return Result::failure(
                     'Enterprises cannot have a parent.',
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] ReturnRemoval
Support/Validation/TeamHierarchyValidator.php:31:13
                 );
             }
 
-            return Result::success(true, ['Enterprise hierarchy validated']);
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] TrueValue
Support/Validation/TeamHierarchyValidator.php:31:13
                 );
             }
 
-            return Result::success(true, ['Enterprise hierarchy validated']);
+            return Result::success(false, ['Enterprise hierarchy validated']);
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] InstanceOf_
Support/Validation/TeamHierarchyValidator.php:35:9
         }
 
         // 2. Orphan Rule
-        if (! $parent instanceof Team) {
+        if ($parent instanceof Team) {
             return Result::failure(
                 'This team type requires a parent team.',
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] ReturnRemoval
Support/Validation/TeamHierarchyValidator.php:36:13
 
         // 2. Orphan Rule
         if (! $parent instanceof Team) {
-            return Result::failure(
-                'This team type requires a parent team.',
-                ['Orphan team validation failed']
-            );
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] MatchArmRemoval
Support/Validation/TeamHierarchyValidator.php:43:9
         }
 
         // 3. Type Compatibility Rule
-        $validParentType = match ($childType) {
-            TeamType::ORGANISATION => TeamType::ENTERPRISE,
-            TeamType::DIVISION => TeamType::ORGANISATION,
-            TeamType::DEPARTMENT => TeamType::DIVISION,
-            TeamType::PROJECT => TeamType::DEPARTMENT,
-            default => null,
-        };
+        
 
         if ($validParentType && $parent->type !== $validParentType) {
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] LogicalAnd
Support/Validation/TeamHierarchyValidator.php:51:9
             default => null,
         };
 
-        if ($validParentType && $parent->type !== $validParentType) {
+        if ($validParentType || $parent->type !== $validParentType) {
             return Result::failure(
                 "{$childType->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.",
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] NotIdentical
Support/Validation/TeamHierarchyValidator.php:51:9
             default => null,
         };
 
-        if ($validParentType && $parent->type !== $validParentType) {
+        if ($validParentType && $parent->type === $validParentType) {
             return Result::failure(
                 "{$childType->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.",
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] ReturnRemoval
Support/Validation/TeamHierarchyValidator.php:52:13
         };
 
         if ($validParentType && $parent->type !== $validParentType) {
-            return Result::failure(
-                "{$childType->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.",
-                ['Type compatibility validation failed']
-            );
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] ArrayItemRemoval
Support/Validation/TeamHierarchyValidator.php:54:17
         if ($validParentType && $parent->type !== $validParentType) {
             return Result::failure(
                 "{$childType->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.",
-                ['Type compatibility validation failed']
+                return Result::failure("{$childType->value} must belong to a {$validParentType->value}, but belongs to {$parent->type->value}.", []);
             );
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamWithVerbsTest.php" not found.

[Killed] GreaterThanOrEqualTo
Support/Validation/TeamHierarchyValidator.php:59:9
         }
 
         // 4. Depth Rule
-        if ($parent->getDepth() >= 10) {
+        if ($parent->getDepth() > 10) {
             return Result::failure(
                 'Team hierarchy depth cannot exceed 10 levels.',
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] GreaterThanOrEqualToNegotiation
Support/Validation/TeamHierarchyValidator.php:59:9
         }
 
         // 4. Depth Rule
-        if ($parent->getDepth() >= 10) {
+        if ($parent->getDepth() < 10) {
             return Result::failure(
                 'Team hierarchy depth cannot exceed 10 levels.',
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.

[Killed] TrueValue
Support/Validation/TeamHierarchyValidator.php:66:9
             );
         }
 
-        return Result::success(true, ['Hierarchy validation passed']);
+        return Result::success(false, ['Hierarchy validation passed']);
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/CreateTeamComponentTest.php" not found.
