[Killed] LogicalNot
Support/Validation/TeamName/ArrayNameQueryBuilder.php:26:9
      */
     public function applyConstraints(Builder $query, array|string $names, Team $team): void
     {
-        if (! is_array($names)) {
+        if (is_array($names)) {
             return;
         }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/ArrayNameQueryBuilderTest.php" not found.

[Killed] ReturnRemoval
Support/Validation/TeamName/ArrayNameQueryBuilder.php:27:13
     public function applyConstraints(Builder $query, array|string $names, Team $team): void
     {
         if (! is_array($names)) {
-            return;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/ArrayNameQueryBuilderTest.php" not found.

[Killed] MethodCallRemoval
Support/Validation/TeamName/ArrayNameQueryBuilder.php:33:9
         $connection = $query->getConnection();
         $driver = $connection->getDriverName();
 
-        $query->where(static function (Builder $q) use ($names, $driver): void {
-            collect($names)
-                ->filter() // Automatically removes null/empty values
-                ->each(static function ($value, $locale) use ($q, $driver): void {
-                    if ($driver === 'pgsql') {
-                        // Cast to JSONB for PostgreSQL to handle JSON operations on VARCHAR columns
-                        $q->orWhereRaw("CAST(name AS JSONB)->>'{$locale}' = ?", [$value]);
-                    } else {
-                        // For other databases, use standard JSON path syntax
-                        $q->orWhere("name->{$locale}", $value);
-                    }
-                });
-        });
+        
     }
 }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/ArrayNameQueryBuilderTest.php" not found.

[Killed] MethodCallRemoval
Support/Validation/TeamName/ArrayNameQueryBuilder.php:34:13
         $driver = $connection->getDriverName();
 
         $query->where(static function (Builder $q) use ($names, $driver): void {
-            collect($names)
-                ->filter() // Automatically removes null/empty values
-                ->each(static function ($value, $locale) use ($q, $driver): void {
-                    if ($driver === 'pgsql') {
-                        // Cast to JSONB for PostgreSQL to handle JSON operations on VARCHAR columns
-                        $q->orWhereRaw("CAST(name AS JSONB)->>'{$locale}' = ?", [$value]);
-                    } else {
-                        // For other databases, use standard JSON path syntax
-                        $q->orWhere("name->{$locale}", $value);
-                    }
-                });
+            
         });
     }
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/ArrayNameQueryBuilderTest.php" not found.

[Killed] Identical
Support/Validation/TeamName/ArrayNameQueryBuilder.php:37:21
             collect($names)
                 ->filter() // Automatically removes null/empty values
                 ->each(static function ($value, $locale) use ($q, $driver): void {
-                    if ($driver === 'pgsql') {
+                    if ($driver !== 'pgsql') {
                         // Cast to JSONB for PostgreSQL to handle JSON operations on VARCHAR columns
                         $q->orWhereRaw("CAST(name AS JSONB)->>'{$locale}' = ?", [$value]);
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/ArrayNameQueryBuilderTest.php" not found.

[Killed] MethodCallRemoval
Support/Validation/TeamName/ArrayNameQueryBuilder.php:39:25
                 ->each(static function ($value, $locale) use ($q, $driver): void {
                     if ($driver === 'pgsql') {
                         // Cast to JSONB for PostgreSQL to handle JSON operations on VARCHAR columns
-                        $q->orWhereRaw("CAST(name AS JSONB)->>'{$locale}' = ?", [$value]);
+                        
                     } else {
                         // For other databases, use standard JSON path syntax
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/ArrayNameQueryBuilderTest.php" not found.
