[Killed] ReturnRemoval
Support/Validation/TeamName/StringNameQueryBuilder.php:29:13
     public function applyConstraints(Builder $query, array|string $name, Team $team): void
     {
         if (! is_string($name) || $name === '') {
-            return;
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Support/Validation/TeamName/StringNameQueryBuilderTest.php" not found.
