[Killed] ReturnRemoval
Support/Validation/TeamNameValidator.php:40:13
         $builder->applyConstraints($query, $nameToCheck, $team);
 
         if ($query->exists()) {
-            return Result::failure(
-                'The team name has already been taken within this scope.',
-                ['Name uniqueness validation failed']
-            );
+            
         }
 
statusReason: INFO  Test file "/Users/s-a-c/Herd/chrrprr/tmp/infection/infection/tests/Feature/Teams/UniqueNameValidationTest.php" not found.
